{
  "periods": [
    "Literatura do konce 18. století",
    "Literatura 19. století",
    "Světová literatura 20. a 21. století",
    "Česká literatura 20. a 21. století"
  ],
  "books": [
    {
      "id": 1,
      "title": "Lakomec",
      "author": "Molière",
      "period": "Literatura do konce 18. století",
      "genre": "Komedie",
      "literaryForm": "Drama",
      "year": "1668",
      "keywords": [
        "divadlo",
        "klasicismus",
        "francouzská literatura",
        "satira"
      ],
      "analysis": {
        "plot": "Harpagon je bohatý pařížský vdovec, který žije se svými dvěma dětmi – synem Kleantem a dcerou Eliškou. Je nesmírně lakomý a své bohatství střeží jako oko v hlavě. Svou truhlici s deseti tisíci zlatých dukátů ukrývá na zahradě.\n\nKleantes je zamilován do chudé dívky Mariany, která žije se svou nemocnou matkou. Když se Harpagon rozhodne, že si Marianu vezme sám za ženu, dojde mezi otcem a synem k ostrému konfliktu. Eliška je zase zamilována do Valéra, který se dostal do domu jako správce pod falešnou identitou.\n\nHarpagon plánuje provdat Elišku za starého bohatého pána Anselma bez věna a oženit Kleanta s bohatou vdovou. Děti jsou zoufalé z otcových sobeckých plánů.\n\nSituace se vyhrotí, když Čipera (Harpagonův sluha, kterého si najal Kleantes) ukradne Harpagonovu truhlici s penězi. Harpagon zuří a obviňuje všechny kolem sebe. Podezírá Valéra, který se přizná k \"únosu\", ale myslí tím Elišku, nikoli peníze.\n\nV závěrečném rozuzlení se zjistí, že Valér a Mariana jsou ve skutečnosti ztracené děti bohatého Anselma, které ztratil při ztroskotání lodi před šestnácti lety. Anselmo je šťasten, že našel své děti.\n\nPříběh končí šťastně – Kleantes dostane Marianu, Eliška Valéra, a Harpagon svou truhlici zpět. Anselmo zaplatí obě svatby, čímž se Harpagon vyhne jakýmkoli výdajům.",
        "themes": {
          "main": "Kritika lakomství jako zhoubné lidské vlastnosti, která ničí mezilidské vztahy a rodinné pouto",
          "motifs": [
            "lakomství",
            "touha po penězích",
            "láska vs. peníze",
            "konflikt generací",
            "pokrytectví",
            "přetvářka",
            "svatba z rozumu"
          ]
        },
        "setting": {
          "place": "Paříž, Harpagonův dům a zahrada",
          "time": "17. století, doba klasicismu za vlády Ludvíka XIV."
        },
        "characters": [
          {
            "name": "Harpagon",
            "description": "Hlavní postava – bohatý lakomý vdovec, posedlý penězi. Jeho jméno je odvozeno od latinského \"harpago\" (dravec). Představuje ztělesnění lakoty – peníze jsou pro něj důležitější než vlastní děti. Komická postava, jejíž chorobná lakota je terčem satiry.",
            "isMain": true
          },
          {
            "name": "Kleantes",
            "description": "Harpagonův syn, zamilovaný do Mariany. Reprezentuje mladou generaci v konfliktu s konzervativním otcem. Je ochoten jít proti otci, aby dosáhl své lásky.",
            "isMain": false
          },
          {
            "name": "Eliška",
            "description": "Harpagonova dcera, miluje Valéra. Oddaná svému milému, ale bojí se otcova hněvu. Pasivnější než její bratr.",
            "isMain": false
          },
          {
            "name": "Valér",
            "description": "Správce v Harpagonově domě, ve skutečnosti šlechtic – syn Anselma. Přijal službu, aby mohl být blízko Elišce. Diplomatický, snaží se vyjít s Harpagonem.",
            "isMain": false
          },
          {
            "name": "Mariana",
            "description": "Chudá, ctnostná dívka, do které se zamiluje Harpagon i Kleantes. Je dcerou Anselma. Ztělesňuje čistotu a mravnost.",
            "isMain": false
          },
          {
            "name": "Anselmo",
            "description": "Starý bohatý šlechtic z Neapole. Otec Valéra a Mariany, které ztratil při ztroskotání lodi. Velikodušný, platí za svatby.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Drama – bez vypravěče, přímá řeč postav",
          "style": "Dialogická forma typická pro divadelní hru"
        },
        "languageDevices": [
          "Próza – na rozdíl od většiny Molièrových her není psána ve verších",
          "Živé dialogy – dynamické rozhovory mezi postavami",
          "Komické opakování – Harpagon neustále opakuje \"Bez věna!\"",
          "Monology – slavný Harpagonův monolog po krádeži truhlice",
          "Slovní hříčky a dvojsmysly",
          "Hyperbola – přehánění Harpagonovy lakoty pro komický efekt"
        ],
        "literaryDevices": [
          {
            "name": "Satira",
            "example": "zesměšnění lakoty jako společenského nešvaru"
          },
          {
            "name": "Ironie",
            "example": "Harpagon nedokáže vidět vlastní pokrytectví"
          },
          {
            "name": "Personifikace",
            "example": "peníze jsou pro Harpagona jako živá bytost (\"má krev, můj život\")"
          },
          {
            "name": "Hyperbola",
            "example": "přehnané reakce Harpagona (\"Zloději! Vrazi!\")"
          },
          {
            "name": "Kontrast",
            "example": "mladí zamilovaní vs. starý lakomec"
          }
        ],
        "authorContext": {
          "bio": "Jean-Baptiste Poquelin (1622–1673), známý pod pseudonymem Molière, byl francouzský dramatik, herec a divadelní ředitel. Je považován za největšího francouzského komediografa.",
          "life": [
            "Narodil se 15. ledna 1622 v Paříži v rodině královského čalouníka a dekoratéra",
            "Jeho matka Marie Cressé zemřela, když mu bylo 10 let",
            "Studoval na prestižní jezuitské koleji Collège de Clermont",
            "Vystudoval práva v Orléans a získal licenci (1642), ale nikdy jako právník nepracoval",
            "V roce 1643 založil s rodinou Béjartů divadelní společnost L'Illustre Théâtre",
            "Společnost zbankrotovala a Molière byl kvůli dluhům krátce uvězněn (1645)",
            "Následujících 13 let cestoval s kočovnou divadelní společností po francouzském venkově",
            "V roce 1658 se vrátil do Paříže a získal přízeň krále Ludvíka XIV.",
            "Zemřel 17. února 1673, několik hodin po kolapsu na jevišti během představení Zdravý nemocný"
          ],
          "otherWorks": [
            {
              "title": "Tartuffe",
              "year": "1664",
              "note": "kritika náboženského pokrytectví, zakázána církví"
            },
            {
              "title": "Don Juan",
              "year": "1665",
              "note": "zpracování legendy o svůdníkovi"
            },
            {
              "title": "Misantrop",
              "year": "1666",
              "note": "kritika společenských konvencí"
            },
            {
              "title": "Zdravý nemocný",
              "year": "1673",
              "note": "satira na hypochondrii, jeho poslední hra"
            }
          ]
        },
        "literaryContext": {
          "movement": "Klasicismus",
          "period": "17.–18. století",
          "description": "Umělecký směr, který vznikl ve Francii za vlády Ludvíka XIV.",
          "characteristics": [
            "Důraz na rozum a řád",
            "Dodržování pravidla tří jednot (místo, čas, děj)",
            "Vzory v antice (Aristoteles, řecké drama)",
            "Střídmost, vyváženost, jasnost",
            "Oddělení žánrů – vysoké (tragédie) a nízké (komedie)"
          ],
          "otherAuthors": [
            {
              "name": "Jean Racine",
              "years": "1639–1699",
              "note": "Francouzský dramatik, autor tragédií",
              "works": [
                "Faidra",
                "Andromacha",
                "Berenika"
              ]
            },
            {
              "name": "Pierre Corneille",
              "years": "1606–1684",
              "note": "Otec francouzské tragédie",
              "works": [
                "Cid",
                "Horatius"
              ]
            },
            {
              "name": "Jean de La Fontaine",
              "years": "1621–1695",
              "note": "Autor bajek",
              "works": [
                "Bajky"
              ]
            }
          ]
        }
      }
    },
    {
      "id": 2,
      "title": "Romeo a Julie",
      "author": "William Shakespeare",
      "period": "Literatura do konce 18. století",
      "genre": "Tragédie",
      "literaryForm": "Drama",
      "year": "1597",
      "keywords": [
        "divadlo",
        "renesance",
        "anglická literatura",
        "láska",
        "tragédie"
      ],
      "analysis": {
        "titleAnalysis": "Název Romeo a Julie zdůrazňuje ústřední postavy a jejich osudovou lásku. Pojmenování podle dvou milenců symbolizuje sílu citu překonávající nenávist i tragické následky rodových sporů.",
        "plot": "Ve Veroně zuří dlouholetá krvavá rozepře mezi dvěma významnými rody – Monteky a Kapulety. Na ulicích dochází k neustálým potyčkám mezi služebníky obou rodin.\n\nRomeo Montek se tajně vydává na maškarní ples do domu Kapuletů, aby spatřil svou lásku Rosalinu. Místo ní však zahlédne Julii Kapuletovou a oba se do sebe okamžitě zamilují. Při slavné balkónové scéně si vyznávají lásku a rozhodnou se k tajnému sňatku.\n\nMnich otec Vavřinec je tajně oddá v naději, že jejich svazek ukončí nenávist mezi rody. Juliin bratranec Tybalt však vyzve Romea na souboj. Romeo odmítá (je nyní Tybaltův příbuzný), ale jeho přítel Merkucio za něj bojuje a je Tybaltem zabit. Romeo v návalu hněvu zabije Tybalta a je odsouzen k vyhnanství z Verony.\n\nRodiče Kapuletovi mezitím naplánují svatbu Julie s hrabětem Parisem. Zoufalá Julie požádá o pomoc otce Vavřince. Ten jí dá lektvar, který ji uvede do stavu zdánlivé smrti na 42 hodin. Zpráva o tomto plánu se však k Romeovi nedostane včas.\n\nRomeo se dozví pouze o Julině 'smrti'. Koupí jed a vydá se k její hrobce. Tam se střetne s Parisem a zabije ho. Nad Juliiným tělem vypije jed a umírá. Julie se probouzí, vidí mrtvého Romea a probodne se jeho dýkou.\n\nNad mrtvými těly svých dětí se oba rody konečně usmíří a slibují postavit zlaté sochy na jejich památku.",
        "themes": {
          "main": "Tragická láska dvou mladých lidí z nepřátelských rodin, která je zničena nenávistí a předsudky jejich okolí",
          "motifs": [
            "láska na první pohled",
            "nenávist rodů",
            "osud vs. svobodná vůle",
            "smrt",
            "mládí vs. stáří",
            "tajemství",
            "noc a tma",
            "světlo a hvězdy"
          ]
        },
        "setting": {
          "place": "Verona (Itálie) – dům Kapuletů, balkón, klášter, hrobka; krátce Mantova",
          "time": "Renesanční Itálie (16. století), děj trvá přibližně 5 dní"
        },
        "composition": {
          "structure": "Hra se skládá z 5 dějství",
          "timeline": "Děj se odvíjí chronologicky"
        },
        "characters": [
          {
            "name": "Romeo Montek",
            "description": "Mladý Montek, citlivý a vášnivý. Zpočátku melancholický, zamilovaný do představy lásky (Rosalina). Po setkání s Julií nachází pravý cit. Impulzivní – zabije Tybalta v afektu, rychle se rozhodne pro sebevraždu. Symbol romantické, absolutní lásky.",
            "isMain": true
          },
          {
            "name": "Julie Kapuletová",
            "description": "Třináctiletá dcera Kapuletů. Zpočátku poslušná dívka, později silná a odhodlaná žena. Postupně dozrává od poslušné dívky k ženě, která se vzepře rodině. Statečná, rozhodná, ochotná zemřít pro lásku.",
            "isMain": true
          },
          {
            "name": "Merkucio",
            "description": "Romeův nejlepší přítel, vtipný a sarkastický. Pronáší slavný monolog o královně Mab. Jeho smrt je zlomovým bodem tragédie – spustí tragickou část děje. Představuje hravost a životní energii.",
            "isMain": false
          },
          {
            "name": "Tybalt",
            "description": "Juliin bratranec, horkokrevný a agresivní. Zosobňuje nenávist mezi rody. Zabije Merkucia a je zabit Romeem. Vznětlivý, provokuje, což se mu stane osudným.",
            "isMain": false
          },
          {
            "name": "Otec Vavřinec",
            "description": "Františkánský mnich, Romeův duchovní rádce. Oddá milence v naději na smíření rodů. Jeho plán s uspávacím lektvarem selže. Moudrý, ale jeho dobré úmysly vedou ke katastrofě.",
            "isMain": false
          },
          {
            "name": "Paris",
            "description": "Hrabě, nápadník Julie. Vznešený, ale nechápe Juliiny city. Juliin budoucí manžel – ona si ho odmítá vzít. Zabit Romeem u hrobky.",
            "isMain": false
          },
          {
            "name": "Chůva",
            "description": "Juliina kojná a důvěrnice. Komická postava, prostořeká. Zpočátku pomáhá milencům, později zradí Julii tím, že jí radí vzít si Parise.",
            "isMain": false
          },
          {
            "name": "Benvolio",
            "description": "Romeův přítel, mírný a rozumný. Jeho jméno je odvozeno z latinského 'benevolens' – laskavý.",
            "isMain": false
          },
          {
            "name": "Kníže Eskalus",
            "description": "Vládce Verony, symbol řádu.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Drama – bez klasického vypravěče. Děj posouvají repliky postav. Vypravěč se projevuje pouze prostřednictvím scénických poznámek.",
          "style": "Zvláštní postavou je Chór v prologu – uvede děj a předznamená tragický osud milenců. Dále už děj tvoří dialogy a monology postav."
        },
        "languageDevices": [
          "Blankvers – nerýmovaný pětistopý jamb, typický pro Shakespeara, dodává důstojnost a rytmus",
          "Střídání prózy a veršů – próza pro nižší postavy a komické scény",
          "Sonety – první setkání Romea a Julie je psáno jako sonet",
          "Slovní hříčky a dvojsmysly (zejména Merkucio a Chůva)",
          "Antiteze – kontrasty: láska/nenávist, světlo/tma, život/smrt",
          "Bohatá obraznost – metafory spojující lásku s náboženstvím",
          "Živé dialogy – dynamické rozhovory mezi postavami",
          "Monology – významné monology obou hlavních postav"
        ],
        "literaryDevices": [
          {
            "name": "Oxymóron",
            "example": "'krásná nenávisti', 'milující nenávist', 'hojivá smrt' – vyjadřuje paradox lásky uprostřed nenávisti"
          },
          {
            "name": "Metafora",
            "example": "Julie jako slunce, Romeo jako hvězda, 'moje láska' = Romeo"
          },
          {
            "name": "Apostrofa",
            "example": "'Ó Romeo, Romeo! Proč jsi Romeo?', 'Ty sobče', 'Drahá dýko' – oslovení nepřítomného, zdůrazňuje osamělost a zoufalství"
          },
          {
            "name": "Personifikace",
            "example": "smrt jako milenec Julie ('Smrt si tě vzala')"
          },
          {
            "name": "Epiteton",
            "example": "'hvězdami zkřížení milenci' (star-crossed lovers), 'hojivá smrt'"
          },
          {
            "name": "Ironie osudu",
            "example": "tragické nedorozumění s dopisem"
          },
          {
            "name": "Řečnická otázka",
            "example": "'Co mně má pomoct?' – vyjadřuje paniku"
          },
          {
            "name": "Epizeuxis",
            "example": "'Tak jděte, jděte!' – zvyšuje napětí"
          },
          {
            "name": "Eufemismus",
            "example": "'věčnost' místo smrti – poetické zjemnění tragédie"
          }
        ],
        "excerpt": {
          "text": "JULIE: Tak jděte, jděte! Já nemám kam jít.\\nCopak to svírá v prstech moje láska?\\nSkleničku? Jed ti pomohl na věčnost?\\nTy sobče, nenechals mi ani kapku.\\nCo mně má pomoct? Slíbám tvoje rty.\\nSnad na nich troška jedu ulpěla a\\nopět spojí nás hojivá smrt.\\n(Líbá Romea na rty.)\\nTvé rty jsou ještě teplé.\\n1. STRÁŽNÍ: (Za scénou) Veď nás! Kudy, chlapče?\\nJULIE: Cože? Už jdou? Tak rychle!\\n(Vezme Romeovu dýku.)\\nDrahá dýko.\\nZde je tvé místo, tady zrezavěj!\\n(Probodne se, padne a zemře.)",
          "context": "Úryvek je ze závěru knihy, je klíčový v kontextu celé knihy. Dříve dal Vavřinec Julii nápoj, který ji uspal na 2×21 hodin. Když ji uviděl nic netušící Romeo, vypil jed a lehl si na tělo Julie. Poté se Julie probouzí a vidí mrtvého Romea."
        },
        "authorContext": {
          "bio": "William Shakespeare (1564–1616) – anglický dramatik a básník, považovaný za největšího spisovatele anglického jazyka a nejvlivnějšího dramatika světové literatury.",
          "life": [
            "Narodil se 23. dubna 1564 ve Stratfordu nad Avonou (Stratford-upon-Avon), Anglie",
            "Jeho otec John Shakespeare byl úspěšný rukavičkář a městský radní",
            "Matka Mary Ardenová pocházela z drobné šlechty",
            "Navštěvoval King's New School ve Stratfordu, kde se učil latinu a rétoriku",
            "V 18 letech (1582) se oženil s Anne Hathawayovou, která byla o 8 let starší",
            "Měl tři děti: Susannu (1583) a dvojčata Hamneta a Judith (1585) – Hamnet zemřel v 11 letech",
            "Kolem roku 1585–1592 jsou tzv. 'ztracená léta' – není známo, co dělal",
            "Od roku 1592 je doložen v Londýně jako herec a začínající dramatik",
            "Stal se členem a spolumajitelem divadelní společnosti Lord Chamberlain's Men (později King's Men)",
            "V roce 1599 se stal spolumajitelem slavného divadla Globe Theatre",
            "V roce 1611 se vrátil do Stratfordu, kde žil až do smrti",
            "Zemřel 23. dubna 1616 (v den svých narozenin)"
          ],
          "creationPeriods": [
            {
              "name": "Rané období (1590–1594)",
              "description": "Historické hry, první komedie"
            },
            {
              "name": "Období komedií (1594–1600)",
              "description": "Sen noci svatojánské, Kupec benátský"
            },
            {
              "name": "Období velkých tragédií (1600–1608)",
              "description": "Hamlet, Othello, Macbeth, Král Lear"
            },
            {
              "name": "Pozdní období – romances",
              "description": "Bouře, Zimní pohádka"
            }
          ],
          "otherWorks": [
            {
              "title": "Hamlet",
              "year": "1601",
              "note": "alžbětinská tragédie o dánském princi, krize jednotlivce i společenských hodnot"
            },
            {
              "title": "Othello",
              "year": "1604",
              "note": "tragédie žárlivosti"
            },
            {
              "title": "Macbeth",
              "year": "1606",
              "note": "tragédie ctižádosti"
            },
            {
              "title": "Král Lear",
              "year": "1605",
              "note": "vrcholná anglická pozdně renesanční tragédie s námětem z keltských pověstí"
            },
            {
              "title": "Sen noci svatojánské",
              "year": "1595",
              "note": "romantická komedie"
            },
            {
              "title": "Bouře",
              "year": "1611",
              "note": "pozdně renesanční poetické drama, vztahy mýtu a umění"
            }
          ],
          "workPosition": "Romeo a Julie patří mezi rané tragédie Shakespeara. Je to poslední hra napsaná v optimistickém období – jakýsi předvoj pro pesimistické období. Důraz na vášeň, konflikt rozumu a citu, osudovost, krásu jazyka."
        },
        "literaryContext": {
          "movement": "Renesance a humanismus",
          "period": "14.–16. století",
          "description": "Kulturní hnutí, které začalo v Itálii a rozšířilo se do Evropy. Anglická renesance vyvrcholila za vlády Alžběty I. (alžbětinská doba). Znovuzrození antických ideálů – rozum, krása, rovnováha.",
          "characteristics": [
            "Humanismus – zájem o člověka, jeho schopnosti a přirozenost",
            "Důraz na člověka, vzdělání, svobodu myšlení",
            "Návrat k antickým vzorům",
            "Rozvoj divadla – veřejná divadla (Globe)",
            "Důraz na individualitu a lidské vášně",
            "Mísení tragického a komického",
            "Rozvoj vědy a objevů: knihtisk, Koperník, Galilei",
            "Postavy s hlubokou psychologií, příběhy o lásce, vášni a lidskosti"
          ],
          "otherAuthors": [
            {
              "name": "Francesco Petrarca",
              "years": "1304–1374",
              "note": "Italský básník, 'otec humanismu'",
              "works": [
                "Sonety Lauře (Zpěvník)"
              ]
            },
            {
              "name": "Giovanni Boccaccio",
              "years": "1313–1375",
              "note": "Italský prozaik",
              "works": [
                "Dekameron – sbírka 100 novel"
              ]
            },
            {
              "name": "Miguel de Cervantes",
              "years": "1547–1616",
              "note": "Španělský spisovatel, vrcholný autor zlatého věku",
              "works": [
                "Důmyslný rytíř Don Quijote de la Mancha"
              ]
            },
            {
              "name": "Christopher Marlowe",
              "years": "1564–1593",
              "note": "Anglický dramatik, Shakespearův současník",
              "works": [
                "Doktor Faustus",
                "Tamburlaine Veliký"
              ]
            },
            {
              "name": "Geoffrey Chaucer",
              "years": "1340–1400",
              "note": "První velký anglický básník",
              "works": [
                "Canterburské povídky"
              ]
            },
            {
              "name": "Francois Villon",
              "years": "1431–1463",
              "note": "Francouzský básník, první prokletý básník",
              "works": [
                "Odkaz (Malý testament)",
                "Závěť (Velký testament)"
              ]
            },
            {
              "name": "Lope de Vega",
              "years": "1562–1635",
              "note": "Španělský dramatik, napsal přes 1800 her",
              "works": [
                "Fuente Ovejuna (Ovčí pramen)"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Hlavním tématem díla je láska a složitost lidských vztahů, což můžeme považovat za věčné a stále aktuální téma.",
          "audience": "Kniha může oslovit mladší, ale i starší lidi, protože zamilovaný může být člověk v každém věku.",
          "purpose": "Smyslem je poukázat na sílu lásky dvou mladých lidí, mezi něž se postaví intriky.",
          "similarWorks": [
            {
              "title": "Romeo, Julie a tma",
              "author": "Jan Otčenášek",
              "year": "1958",
              "note": "Tragická novela z prostředí okupace Československa za druhé světové války, heydrichiády. Příběh Pavla a židovky Ester, jejichž lásku rozdělí vojáci. Slovo 'tma' symbolizuje dusné prostředí stanného práva."
            }
          ],
          "adaptations": [
            "Americký film Romeo a Julie z roku 1996 – Leonardo DiCaprio v hlavní roli",
            "Americký animovaný film Romeo a Julie z roku 2006 – pozměněný konec",
            "Mnoho dalších divadelních i filmových zpracování"
          ]
        }
      }
    },
    {
      "id": 3,
      "title": "Král Lávra",
      "author": "Karel Havlíček Borovský",
      "period": "Literatura 19. století",
      "genre": "Satirická báseň",
      "literaryForm": "Poezie",
      "year": "1870",
      "keywords": [
        "satira",
        "alegorie",
        "česká literatura",
        "politika"
      ],
      "analysis": {
        "titleAnalysis": "Snaha o vtipnou zveršovanou pohádku, zesměšnění vrchnosti. Král Lávra = hlavní hrdina příběhu.",
        "plot": "Vypravěč povídá píseň o starém, irském králi Lávrovi. Lid má krále rád, protože dobře vládne, jen jednu slabost má, a to, že po oholení holiče na šibenici posílá. Ale i na to si lidé zvykli, až na holiče, ti si zvyknout nemohli.\n\nLetos padl los na holiče Kukulína, staré vdovy syna. Potom co krále ostříhal a táhli ho na šibenici, jeho matka ho od krále nakonec vyprosila. Lávra si tedy pozval Kukulína a ten mu slíbil, že bude mlčet a stane se jeho dvorním holičem.\n\nBohatý dvorní holič však trápení měl, že tajemství nikomu prozradit nesměl. Jeho maminka ho tedy poslala do lesa pro radu k poustevníkovi. Poustevník mu řekl jediný lék, pošeptat vrbě svůj zármutek.\n\nPo krátké době objednal si král české karlovarské hudebníky na svůj bál. Basista Červíček ztratil z basy kolíček a u Vinkovského brodu udělal si nový ze staré vrby. Když na bále smyčcem spustil, basa začala řvát: 'Král Lávra má dlouhé oslí uši, král je ušatec!'\n\nCo nyní celý svět věděl od basy, nebylo nic platno skrývat pod vlasy. Po krátké době si lid zvykl, že dlouhé uši koruně docela sluší. Kukulín krále stříhal dál, protože nikdy nevyšlo, jak tajemství na svět z basy přišlo. A tak, když tě něco na jazyku svrbí, zašeptej to do staré vrby.",
        "themes": {
          "main": "Královo tajemství a jeho odhalení – satira na vrchnost a tyranii moci",
          "motifs": [
            "tajemství",
            "oslí uši",
            "šibenice",
            "holič",
            "vrba",
            "basa",
            "moc a tyranie"
          ]
        },
        "setting": {
          "place": "Irsko, královský dvůr",
          "time": "Před dávnou dobou (neurčený čas, pohádkový rámec)"
        },
        "composition": {
          "structure": "Báseň má 34 strof po 7 verších",
          "timeline": "Děj se odvíjí chronologicky",
          "rhyme": "1. a 3. verš se nerýmuje, rýmové schéma – ABCBDDB"
        },
        "characters": [
          {
            "name": "Král Lávra",
            "description": "Dobrý panovník, nechce, aby nikdo věděl jeho tajemství – stydí se za svoje oslí uši. Nechává popravit každého holiče, který jeho tajemství pozná.",
            "isMain": true
          },
          {
            "name": "Kukulín",
            "description": "Holič, čestný, spravedlivý, bojácný, smířený s osudem, utrápený potřebou se svěřit. Syn staré vdovy.",
            "isMain": true
          },
          {
            "name": "Kukulínova matka",
            "description": "Vdova, milující matka, která zachránila syna před šibenicí – vyprosila ho u krále.",
            "isMain": false
          },
          {
            "name": "Muzikant Červíček",
            "description": "Basista z karlovarské kapely, který si vyrobil kolíček z vrby a nevědomky prozradil královo tajemství.",
            "isMain": false
          },
          {
            "name": "Poustevník",
            "description": "Moudrý rádce v lese, poradil Kukulínovi, aby tajemství pošeptal vrbě.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Er-forma (vševědoucí vypravěč)",
          "style": "Písňová forma, pásmo vypravěče s přímou řečí postav"
        },
        "excerpt": {
          "text": "Všem se kázal vzdálit,\njen sám Kukulín,\npovolán ku králi,\nbledý jako stín;\nKrál tu sedí, na klíně korunu:\n'Přistup, synu, blíže sem ke trůnu\ni pod baldachýn.\n\nPřísahej, že smlčíš\nNa věčné časy,\nco jsi na mé hlavě\nviděl pod vlasy,\npak se tobě neublíží v ničem\na ty budeš mým dvorním holičem\npo všechny časy.'",
          "context": "Úryvek je z poloviny básně. Král si pozval Kukulína a nabízí mu život výměnou za mlčení o jeho tajemství – oslích uších."
        },
        "languageDevices": [
          "Knižní výrazy – 'povolán ku králi'",
          "Familiární oslovení – 'synu'",
          "Archaismy – 'baldachýn', 'smlčíš'",
          "Lidová mluva",
          "Přímá řeč krále"
        ],
        "literaryDevices": [
          {
            "name": "Přirovnání",
            "example": "'bledý jako stín'"
          },
          {
            "name": "Hyperbola",
            "example": "'na věčné časy', 'po všechny časy' – přehánění pro zdůraznění"
          },
          {
            "name": "Alegorie",
            "example": "Celý příběh je alegorií na tyranii moci a utajování pravdy před lidem"
          },
          {
            "name": "Písňová forma",
            "example": "Pravidelné strofy s refrénovým charakterem"
          }
        ],
        "authorContext": {
          "bio": "Karel Havlíček Borovský (1821–1856) – český básník, novinář, ekonom, překladatel a politik. Považován za zakladatele české žurnalistiky, satiry a literární kritiky. Literárně řazen do realismu, politicky patří do tzv. generace národních buditelů.",
          "life": [
            "Přídomek 'Borovský' je odvozen od místa narození – Borová u Přibyslavi",
            "Jako devítiletý odchází na školu do Jihlavy, kde se učil němčině",
            "Gymnázium studoval v Německém Brodě (dnes Havlíčkův Brod)",
            "Od roku 1838 studoval filozofii v Praze",
            "V 19 letech vstoupil do semináře, ale odešel – nesnesl přesný režim a přetvářku církve",
            "Odjel do Ruska jako vychovatel, po roce se vrátil vystřízlivěný z ruských poměrů",
            "Redaktor a zakladatel Národních novin",
            "V roce 1848 zatčen za rušení veřejného pokoje, ale brilantní obhajobou osvobozen",
            "Vykázán z Prahy, usadil se v Kutné Hoře, kde vydával časopis Slovan",
            "V letech 1851–1855 deportován do tyrolského Brixenu, kde napsal Tyrolské elegie, Král Lávra a Křest svatého Vladimíra",
            "Během návštěvy rodiny se nakazil tuberkulózou",
            "Na pohřbu Božena Němcová položila na jeho rakev trnovou korunu jako symbol mučednictví"
          ],
          "otherWorks": [
            {
              "title": "Tyrolské elegie",
              "year": "1852",
              "note": "satirická báseň o cestě do Brixenu, výsměch rakouské vládě"
            },
            {
              "title": "Křest svatého Vladimíra",
              "year": "1854",
              "note": "satirická skladba o carovi, který nechá utopit boha Peruna"
            },
            {
              "title": "Epigramy",
              "year": "1845",
              "note": "krátké satirické básně"
            },
            {
              "title": "Obrazy z Rus",
              "year": "1843",
              "note": "cestopisné reportáže z Ruska"
            }
          ],
          "workPosition": "Král Lávra patří mezi tři vrcholné satirické skladby, které Havlíček napsal v Brixenu. Je to politická satira – vrchol jeho tvorby."
        },
        "literaryContext": {
          "movement": "Národní obrození, počátky realismu",
          "period": "1. polovina 19. století (4. fáze národního obrození)",
          "description": "Hledání východiska z krize světa, důraz na národ, prolínání romantismu s realismem. Potřeba vlastenectví s funkcí literatury ve vztahu ke společnosti. Hájení demokratických zásad proti vládě a církvi.",
          "characteristics": [
            "Důraz na národ, vychází z lidové tvorby",
            "Prolínání romantismu s realismem",
            "Venkovská próza, idylické dětství",
            "Hájení demokratických zásad proti vládě a církvi",
            "Realismus – přiblížení se ke skutečnosti a objektivitě"
          ],
          "otherAuthors": [
            {
              "name": "Josef Kajetán Tyl",
              "years": "1808–1856",
              "note": "Významný český dramatik, putoval s kočovným divadlem",
              "works": [
                "Strakonický dudák",
                "Fidlovačka"
              ]
            },
            {
              "name": "Karel Jaromír Erben",
              "years": "1811–1870",
              "note": "Sbíral lidové písně a pohádky, seznámil se s Palackým",
              "works": [
                "Kytice z pověstí národních",
                "Prostonárodní české písně a říkadla"
              ]
            },
            {
              "name": "Božena Němcová",
              "years": "1820–1862",
              "note": "Dětství v ratibořickém údolí, dívčí jméno Barbora Panklová",
              "works": [
                "Babička",
                "Divá Bára",
                "V zámku a v podzámčí"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Dílo je stále aktuální – každý člověk dělá chyby a nemusí se stydět za to, jak vypadá.",
          "purpose": "Satira, která je zdánlivě prostoupena mírnějším tónem. Havlíček pojednává o králi s oslíma ušima, který nechává popravit každého, kdo pozná pravdu. I smírný konec je parodií na 'hodné' panovníky.",
          "similarWorks": [
            {
              "title": "Tyrolské elegie",
              "author": "Karel Havlíček Borovský",
              "year": "1852",
              "note": "Další satirická skladba, ostré vystupování proti vládě"
            },
            {
              "title": "Křest svatého Vladimíra",
              "author": "Karel Havlíček Borovský",
              "year": "1854",
              "note": "Nedokončená satirická skladba o carovi a náboženství"
            }
          ]
        }
      }
    },
    {
      "id": 4,
      "title": "Povídky",
      "author": "Edgar Allan Poe",
      "period": "Literatura 19. století",
      "genre": "Povídka",
      "literaryForm": "Próza",
      "year": "19. století",
      "subworks": [
        "Jáma a kyvadlo",
        "Černý kocour",
        "+1 navíc"
      ],
      "keywords": [
        "romantismus",
        "horor",
        "americká literatura",
        "detektivka"
      ],
      "analysis": null
    },
    {
      "id": 5,
      "title": "Tyrolské elegie",
      "author": "Karel Havlíček Borovský",
      "period": "Literatura 19. století",
      "genre": "Satirická báseň",
      "literaryForm": "Poezie",
      "year": "1852",
      "keywords": [
        "satira",
        "alegorie",
        "česká literatura",
        "politika",
        "Brixen"
      ],
      "analysis": {
        "titleAnalysis": "Tyrolské elegie – město Brixen v Tyrolsku (místo, kde byl K. H. B. vězněn), elegie = žalozpěv. Název odkazuje na místo vyhnanství a žánr lyrické poezie.",
        "plot": "Borovského dílo popisuje jeho cestu do rakouského Brixenu v devíti zpěvech.\n\nV prvním zpěvu Borovský promlouvá k měsíci v Brixenu. Druhý zpěv vypráví o 'návštěvě' policajtů – dvě hodiny po půlnoci přicházejí s dopisem z Vídně od pana Bacha.\n\nVe třetím zpěvu čte dopis a dozvídá se, že prý kvůli jeho zdraví musí odjet do Brixenu. Čtvrtý zpěv – policajti mají naspěch a radí mu, aby si nebral žádné zbraně, ochraňovat ho budou oni.\n\nV pátém zpěvu mluví o loučení s rodinou: 'Matka, žena, sestra, dcerka, malá Zdenička, stály okolo mne v tichém pláči – hořká chvilinka.'\n\nŠestý zpěv – za dohledu četníků vyráží na cestu. Sedmý zpěv vypráví o cestě a městech, hradech, které potkal. Zároveň si utahuje ze svých 'strážců'.\n\nV osmém, nejdelším zpěvu vypráví o tom, jak se splašili koně a policajti vyskákali z kočáru. Do Brixenu přijíždí sám, policajti za ním pěšky: 'Ach, ty vládo, převrácená vládo! Národy na šnůrce vodit chceš, ale čtyřmi koňmi bez opratí vládnout nemůžeš.'\n\nDevátý zpěv – Borovský přijel do Brixenu, je vězněn: 'Místo mne ten kus papíru vrátili do Čech, mne zde černý dvojhlavý orel drží v klepetech.'",
        "themes": {
          "main": "Cesta do vyhnanství v Brixenu – satirický výsměch rakouské vládě a policejnímu státu",
          "motifs": [
            "cesta do vyhnanství",
            "policajti",
            "vláda",
            "svoboda",
            "rodina",
            "Alpy",
            "splašení koně"
          ]
        },
        "setting": {
          "place": "Čechy → cesta do Brixenu (Tyrolsko, Rakousko)",
          "time": "Cesta započala 16. prosince 1851"
        },
        "composition": {
          "structure": "Báseň má 9 zpěvů, každá sloka má 4 verše",
          "timeline": "Děj je vyprávěn chronologicky",
          "rhyme": "Rým je přerývaný (ABCB)"
        },
        "characters": [
          {
            "name": "Vypravěč (K. H. Borovský)",
            "description": "Autor díla, škodolibý, moudrý, ironický. Vypráví svůj příběh v ich-formě s humorem a sarkasmem.",
            "isMain": true
          },
          {
            "name": "Policajti",
            "description": "Vládní příslušníci, slepě plní rozkazy od hlavy státu. Komické postavy, které autor zesměšňuje.",
            "isMain": false
          },
          {
            "name": "Dedera",
            "description": "Policejní komisař Franz Dedera, skutečná postava. Slepě plní úkoly, omezený.",
            "isMain": false
          },
          {
            "name": "Postmistr Dahrupp",
            "description": "Skutečná postava, svědek příjezdu Borovského do Brixenu.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Ich-forma (vypravěčem je sám Borovský)",
          "style": "Monolog vypravěče s neznačenou přímou řečí, satirický tón"
        },
        "excerpt": {
          "text": "Ach ty světe, obrácený světe!\nVzhůru nohami ve škarpě leží stráž,\nale s panem delikventem samým\nkluše ekypáž!\n\nAch ty vládo, převrácená vládo!\nNárody na šňůrce vodit chceš,\nale čtyřmi koňmi na opratích\nvládnout nemůžeš!",
          "context": "Osmý zpěv, téměř konec cesty. Koně se splašili, policajti vyskákali z kočáru a Borovský přijíždí do Brixenu sám."
        },
        "languageDevices": [
          "Archaismy – 'pravím', 'svěřiti', 'resignace'",
          "Citoslovce – 'ejhle!'",
          "Nespisovná slova – 'policajti', 'škarpa', 'čerstvěj'",
          "Přechodník minulý – 'vyrazivše'",
          "Slova cizího původu – 'ekypáž' (kočár)",
          "Řečnická otázka – 'Což se mi může horšího již stát?'",
          "Vulgarismus – 'v hubě'",
          "Rozkazovací věty – 'Metejme los!'"
        ],
        "literaryDevices": [
          {
            "name": "Apostrofa",
            "example": "'Ach ty světe, obrácený světe!', 'Ach ty vládo, převrácená vládo!' – oslovení nepřítomného"
          },
          {
            "name": "Personifikace",
            "example": "'národy na šňůrce vodit chceš' – vláda personifikována jako kočí"
          },
          {
            "name": "Přirovnání",
            "example": "'tak jsem cválal sám a sám v kočáře jako vítr s Alpy'"
          },
          {
            "name": "Ironie a sarkasmus",
            "example": "Celá báseň je prostoupena ironickým tónem vůči rakouské vládě"
          },
          {
            "name": "Antiteze",
            "example": "Kontrast mezi 'delikventem' a jeho důstojným chováním vs. směšností policajtů"
          }
        ],
        "authorContext": {
          "bio": "Karel Havlíček Borovský (1821–1856) – český básník, novinář, ekonom, překladatel a politik. Považován za zakladatele české žurnalistiky, satiry a literární kritiky.",
          "life": [
            "Přídomek 'Borovský' je odvozen od místa narození – Borová u Přibyslavi",
            "Jako devítiletý odchází na školu do Jihlavy",
            "Gymnázium studoval v Německém Brodě (dnes Havlíčkův Brod)",
            "Od roku 1838 studoval filozofii v Praze",
            "V 19 letech vstoupil do semináře, ale odešel – nesnesl přesný režim církve",
            "Odjel do Ruska jako vychovatel, po roce se vrátil vystřízlivěný",
            "Redaktor a zakladatel Národních novin",
            "V roce 1848 zatčen, ale brilantní obhajobou osvobozen",
            "V Kutné Hoře vydával časopis Slovan – jediný veřejný časopis proti vládě",
            "V letech 1851–1855 deportován do Brixenu, kde napsal své vrcholné satirické skladby",
            "Během návštěvy rodiny se nakazil tuberkulózou a zemřel"
          ],
          "otherWorks": [
            {
              "title": "Král Lávra",
              "year": "1854",
              "note": "satirická báseň o králi s oslíma ušima"
            },
            {
              "title": "Křest svatého Vladimíra",
              "year": "1854",
              "note": "nedokončená satirická skladba o carovi, který nechá utopit boha Peruna"
            },
            {
              "title": "Epigramy",
              "year": "1845",
              "note": "krátké satirické básně"
            },
            {
              "title": "Obrazy z Rus",
              "year": "1843",
              "note": "cestopisné reportáže z Ruska"
            }
          ],
          "workPosition": "Tyrolské elegie patří mezi tři vrcholné skladby, které vznikly v Brixenu v letech 1851–1855. Je to politická satira – vrchol tvorby."
        },
        "literaryContext": {
          "movement": "Národní obrození, počátky realismu",
          "period": "1. polovina 19. století (4. fáze národního obrození)",
          "description": "Hledání východiska z krize světa, důraz na národ. Potřeba vlastenectví s funkcí literatury ve vztahu ke společnosti. Hájení demokratických zásad proti vládě a církvi.",
          "characteristics": [
            "Důraz na národ, vychází z lidové tvorby",
            "Prolínání romantismu s realismem",
            "Hájení demokratických zásad proti vládě a církvi",
            "Realismus – přiblížení se ke skutečnosti"
          ],
          "otherAuthors": [
            {
              "name": "Josef Kajetán Tyl",
              "years": "1808–1856",
              "note": "Významný český dramatik",
              "works": [
                "Strakonický dudák",
                "Fidlovačka"
              ]
            },
            {
              "name": "Karel Jaromír Erben",
              "years": "1811–1870",
              "note": "Sbíral lidové písně a pohádky",
              "works": [
                "Kytice z pověstí národních"
              ]
            },
            {
              "name": "Božena Němcová",
              "years": "1820–1862",
              "note": "Autorka Babičky",
              "works": [
                "Babička",
                "Divá Bára"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Dílo je v dnešní době spíše neaktuální jako přímá kritika – bylo myšleno jako výsměch rakouské vládě. Obecně však zůstává aktuální jako satira na byrokratický stát.",
          "purpose": "Báseň vypráví o autorově cestě do rakouského Brixenu, naráží na vládu a vysmívá se jí. Osobní zážitky vyjadřuje ironicky a sarkasticky, ponižuje rakouskou monarchii.",
          "similarWorks": [
            {
              "title": "Král Lávra",
              "author": "Karel Havlíček Borovský",
              "year": "1854",
              "note": "Další satirická skladba z Brixenu"
            },
            {
              "title": "Křest sv. Vladimíra",
              "author": "Karel Havlíček Borovský",
              "year": "1854",
              "note": "Satiry zaměřené na politickou situaci"
            }
          ]
        }
      }
    },
    {
      "id": 6,
      "title": "Stařec a moře",
      "author": "Ernest Hemingway",
      "period": "Světová literatura 20. a 21. století",
      "genre": "Novela",
      "literaryForm": "Próza",
      "year": "1952",
      "keywords": [
        "americká literatura",
        "ztracená generace",
        "moře",
        "rybaření",
        "symbolismus"
      ],
      "analysis": {
        "titleAnalysis": "Většina příběhu se odehrává na moři, kde stařec Santiago rybaří a zápasí s rybou. Název odkazuje na hlavního hrdinu a místo děje.",
        "plot": "Kniha vypráví o starém rybáři Santiagovi, pro kterého je rybaření jedinou obživou. Starci se ovšem dlouho nedaří chytit větší rybu, a proto je ostatním rybářům k smíchu. Aby toho nebylo málo, tak s ním na moře, kvůli zákazu svého otce, přestane jezdit velký pomocník, chlapec Manolin.\n\nStařec má ovšem svoji hrdost a rozhodne se všem dokázat, že stále dokáže chytit velkou rybu. Druhý den ráno se proto na moři vydá dál, než kdy byl. Kvůli svým zkušenostem ví, že pokud chce chytit velkou rybu, musí udice spustit do velkých hloubek.\n\nZa nějakou dobu zabere opravdu velká ryba. Jenomže má spoustu sil, a stařec ji proto nemůže ulovit. Zápasí s ní dva dny bez spaní a způsobí si drobná zranění. Rybář je ovšem rozhodnut, že nepovolí a rybu zabije, nebo že zabije ryba jeho. Po dvou probdělých nocích ryba ztrácí sílu a Santiago ji uloví. Zjistí, že je to mečoun a je několikrát větší než loďka.\n\nStařec ulovenou rybu přiváže k loďce a vydá se domů. Jenže krvácející ryba přivábí několik žraloků. Rybář se s nimi snaží bojovat, ale nemá šanci a žraloci mu rybu do posledního drobečku sežerou. Zůstane jenom kostra, se kterou se v noci vrátí do přístavu a vyčerpán odejde do svého domu. Ráno ho v posteli objeví chlapec, počká, až se probudí, a potom mu povídá, kolik lidí se shromáždilo kolem obří kostry. Lidé kostru ryby obdivují a on na sebe může být hrdý.",
        "themes": {
          "main": "Lov ryby jako symbol neustálého boje člověka s přírodou",
          "motifs": [
            "žralok",
            "maso",
            "stařec",
            "krev",
            "moře",
            "ryba",
            "hrdost",
            "vytrvalost"
          ]
        },
        "setting": {
          "place": "Kubánská vesnice, moře poblíž hlavního města Kuby Havana",
          "time": "1. polovina 20. století"
        },
        "composition": {
          "structure": "Příběh je vyprávěn chronologicky",
          "timeline": "Děj trvá několik dní"
        },
        "characters": [
          {
            "name": "Stařec Santiago",
            "description": "Kubánský rybář velice pevné vůle a skromné povahy, který musí tvrdě pracovat, aby se uživil. Hrdý, vytrvalý, odhodlaný.",
            "isMain": true
          },
          {
            "name": "Chlapec Manolin",
            "description": "Velmi obětavý, laskavý, pomocník při rybolovu, který má rád starce. Kvůli zákazu otce s ním přestane jezdit na moře.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Střídání er-formy (vypravěč) s ich-formou (rozmluvy Santiaga s chlapcem, s rybou a se sebou samým)",
          "style": "Pouze pásmo vypravěče, metoda ledovce – podstatné je to 'pod vodou' (cílem si to domyslet)"
        },
        "excerpt": {
          "text": "Žralok je rychle dohnal odzadu, a když se vrhl na rybu, viděl stařec jeho otevřenou tlamu a podivné oči a slyšel cvaknutí jeho zubů, když se zahryzl do rybího masa těsně nad ocasem. Žraločí hlava vyčnívala z vody a jeho hřbet se vynořoval a stařec slyšel, jak se na jeho velké rybě trhá kůže a maso. V tom okamžiku stařec vrazil harpunu žralokovi do hlavy v těch místech, kde spojnice mezi očima protínala čáru, táhnoucí se mu od nosu přímo vzad. Ty čáry nebylo ve skutečnosti vidět. Bylo vidět jen těžkou špičatou modrou hlavu a veliké oči a cvakající, dravě chňapající hltavé čelisti. Ale v těch místech má žralok mozek a stařec ho tam zasáhl. Zasáhl ho svýma krví pomazanýma rukama a vbodl mu tam dobře mířenou harpunu ze všech sil. Vrazil mu ji tam bez naděje, ale odhodlaně a s naprostou škodolibou nenávistí.",
          "context": "Úryvek je ze závěrečné části knihy, kdy má stařec rybu ulovenou a při cestě domů bojuje se žraloky."
        },
        "languageDevices": [
          "Onomatopie – 'cvaknutí', 'zadrnčel'",
          "Odborný výraz – 'harpuna'"
        ],
        "literaryDevices": [
          {
            "name": "Epiteton",
            "example": "'podivné oči', 'těžká špičatá modrá hlava', 'dravě chňapající hltavé čelisti'"
          },
          {
            "name": "Eufemismus",
            "example": "'mu v oku vyhasl život'"
          },
          {
            "name": "Personifikace",
            "example": "'žralok to nechtěl uznat'"
          },
          {
            "name": "Přirovnání",
            "example": "'rozrýval hladinu jako rychlý motorový člun'"
          }
        ],
        "authorContext": {
          "bio": "Ernest Hemingway (21. 7. 1899, USA – 2. 7. 1961, USA) – americký spisovatel, novinář, povídkář, dramatik. Miloval přírodu, lov a dobrodružství. Čelní představitel Ztracené generace.",
          "life": [
            "Po absolvování základní školy se stal reportérem kansaského listu Star",
            "Byl velmi ovlivněn válečnými událostmi",
            "Hned po vypuknutí 1. světové války vstoupil do italské armády jako dobrovolník ambulantních sborů Červeného kříže",
            "Byl těžce raněn",
            "Španělské občanské války se zúčastnil jako reportér",
            "Válečný zpravodaj v Číně",
            "Za druhé světové války pobýval na Kubě a vyhledával německé ponorky v Karibském moři",
            "V roce 1953 získal Pulitzerovu cenu",
            "V roce 1954 dostal Nobelovu cenu",
            "Ve svých dílech vystupuje pod pseudonymem Nick Adams",
            "V roce 1961 pravděpodobně spáchal sebevraždu (zastřelil se puškou)"
          ],
          "otherWorks": [
            {
              "title": "Sbohem, armádo",
              "year": "1929",
              "note": "Román s autobiografickými prvky. Vypravěčem je americký poručík Frederic Henry, který sloužil za první světové války v italské armádě."
            },
            {
              "title": "Komu zvoní hrana",
              "year": "1940",
              "note": "Román z občanské války ve Španělsku"
            },
            {
              "title": "Pátá kolona",
              "year": "1938",
              "note": "Jediné drama, které Hemingway napsal. Tematicky vychází ze zkušeností ze španělské občanské války."
            }
          ],
          "style": "Metoda ledovce – podstatné je to 'pod vodou' (cílem si to domyslet). Jeho postavami jsou muži – stateční, cílevědomí, ctižádostiví, staví je do kritické mezní situace.",
          "workPosition": "Poslední kniha, kterou napsal (1952), získal za ni Nobelovu cenu."
        },
        "literaryContext": {
          "movement": "Ztracená generace",
          "period": "1. polovina 20. století",
          "description": "Skupina spisovatelů narozených kolem roku 1900, kteří zažili první světovou válku a zobrazovali ji ve svých dílech. Vyjadřují pocity vojáků po návratu z války (vrátili se duševně zmrzačeni a měli problémy se zařazením se do společnosti).",
          "characteristics": [
            "Spisovatelé zažili první světovou válku a zobrazovali ji ve svých dílech",
            "Vyjadřují pocity vojáků po návratu z války",
            "Pro autory jsou typické životní postoje, kterými dávají najevo nesouhlas a nedůvěru ke společnosti",
            "Často staví své hrdiny do velmi nebezpečných situací, kde musí prokazovat svůj charakter",
            "Základními tématy jsou zklamání a skepse, rozklad lidských a společenských hodnot",
            "Hledání východiska v útěku do přírody nebo kultury"
          ],
          "otherAuthors": [
            {
              "name": "Erich Maria Remarque",
              "years": "1898–1970",
              "note": "Vlastním jménem Erich Paul Remark, Němec. Odešel jako dobrovolník do 1. světové války, v roce 1918 byl raněn. Po nástupu fašismu v Německu v roce 1933 se dostal na seznam zakázaných autorů.",
              "works": [
                "Na západní frontě klid",
                "Miluj bližního svého",
                "Tři kamarádi"
              ]
            },
            {
              "name": "Romain Rolland",
              "years": "1866–1944",
              "note": "Francouz, prozaik, dramatik, esejista, hudební historik a literární kritik. Nositel Nobelovy ceny za literaturu (1915).",
              "works": [
                "Jan Kryštof",
                "Petr a Lucie",
                "Dobrý člověk ještě žije"
              ]
            },
            {
              "name": "William Faulkner",
              "years": "1897–1962",
              "note": "Američan, prozaik, básník, scenárista. Nositel Nobelovy ceny za literaturu (1949).",
              "works": [
                "Absolone, Absolone",
                "Pobertové",
                "Vojákův žold"
              ]
            },
            {
              "name": "John Steinbeck",
              "years": "1902–1968",
              "note": "Američan. Nositel Nobelovy ceny za literaturu (1962) a Pulitzerovy ceny (1940). Prokazuje zájem o sociální problémy.",
              "works": [
                "O myších a lidech",
                "Hrozny hněvu",
                "Na východ od ráje"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Opovrhování lidmi, kterým se nedaří, je dnes běžné. Závist je dnes také běžná. Lidská hrdost a víra ještě nevymizely, proto je dílo určitě aktuální.",
          "audience": "Kniha má oslovit všechny generace lidí. Starší generaci kvůli zobrazení, že staří lidé nejsou zbyteční, ale dokážou spoustu věcí. Mladší generaci kvůli zobrazení chování a úcty mladšího ke staršímu.",
          "purpose": "Novela řeší problém lidského přesvědčení a nezdolnost lidské odhodlanosti. Hlavní myšlenkou tohoto díla je ukázat na neustálý boj člověka s přírodou. Smyslem je poukázání na lidskou statečnost a velkou duševní sílu.",
          "similarWorks": [
            {
              "title": "Robinson Crusoe",
              "author": "Daniel Defoe",
              "year": "1719",
              "note": "Fyzicky zdatný muž je nucen postarat se sám o sebe"
            }
          ],
          "adaptations": [
            "Americký film Stařec a moře z roku 1958 je na ČSFD hodnocen 74 %"
          ]
        }
      }
    },
    {
      "id": 7,
      "title": "Malý princ",
      "author": "Antoine de Saint-Exupéry",
      "period": "Světová literatura 20. a 21. století",
      "genre": "Pohádka / Filosofická próza",
      "literaryForm": "Próza",
      "year": "1943",
      "keywords": [
        "francouzská literatura",
        "pohádka",
        "filozofie",
        "přátelství",
        "děti"
      ],
      "analysis": {
        "titleAnalysis": "Hlavním hrdinou díla je malý princ – záhadná bytost z jiné planety.",
        "plot": "Kniha začíná příběhem malého chlapce, který se snaží zaujmout dospělé svými kresbami, ale nedaří se mu to. Dospělí pro něho nemají pochopení. Chlapec se rozhodne, že se nikdy nebude chovat jako dospělí.\n\nDalší děj se odehrává o několik let později, když chlapec vyroste v pilota a ztroskotá na Saharské poušti. Setká se tam s malým princem, který chce nakreslit beránka. Malý princ se s pilotem spřátelí a vypráví mu o své planetě a o svém cestování.\n\nNejprve popisuje svou planetu B612, na které má tři sopky, spoustu rostlin − baobabů a jednu květinu, která byla kvůli své kráse a pocitu, že je na světě jediná, velmi pyšná. Dále vyprávěl o svých cestách po okolních planetách. Na každé planetě byla pouze jedna osoba − král, domýšlivec, pijan, byznysmen, lampář a spisovatel (zeměpisec) − a každá zastupovala určitou vlastnost.\n\nJako poslední planetu navštívil Zemi, kde se seznámil s hadem a liškou, která mu vysvětlila důležitost přátelství. Objevil ozvěnu a květinovou zahradu. Seznámil se s výhybkářem a obchodníkem.\n\nNa závěr příběhu se nechá malý princ uštknout hadem, aby se vrátil na svoji planetku. Když to zjistí pilot, je smutný, protože ztratil svého přítele.",
        "themes": {
          "main": "Důležitost přátelství a kritika špatných lidských vlastností",
          "motifs": [
            "planeta",
            "létání",
            "beránek",
            "snění",
            "letadlo",
            "růže",
            "liška",
            "had"
          ]
        },
        "setting": {
          "place": "Poušť Sahara, různé planety (B612, planeta krále, domýšlivce, pijana, byznysmena, lampáře, zeměpisce, Země)",
          "time": "Není přesně určen; 1. polovina 20. století"
        },
        "composition": {
          "structure": "Děj je vyprávěn retrospektivně – malý princ vypráví pilotovi, které planety navštívil a co na nich zažil",
          "timeline": "Úryvek je rozdělen do odstavců"
        },
        "characters": [
          {
            "name": "Malý princ",
            "description": "Zvědavý malý chlapec s blonďatými vlasy, přátelský. Pochází z planety B612.",
            "isMain": true
          },
          {
            "name": "Letec (pilot)",
            "description": "Vypravěč, rozumný muž, přátelský. Reprezentuje samotného autora – Saint-Exupéryho.",
            "isMain": true
          },
          {
            "name": "Květina (růže)",
            "description": "Pyšná růže, nedávající najevo své city. Důvod, proč malý princ opustil svou planetu.",
            "isMain": false
          },
          {
            "name": "Liška",
            "description": "Moudrá, přátelská, radila princovi. Vysvětlila mu důležitost přátelství a zkrocení.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Ich-forma – vypravěčem příběhu je pilot (sám Exupéry)",
          "style": "Přímá řeč pilota a malého prince, dialog, pásmo vypravěče"
        },
        "excerpt": {
          "text": "Co to je za věc? To není věc. To létá. Je to letadlo... Moje letadlo. A byl jsem hrdý, že mohu říci, že létám. A tu zvolal: Jejda! Ty jsi spadl z nebe! Ano, odpověděl jsem skromně. Jé, to je divné... A malý princ se roztomile zasmál. To mě hrozně pohněvalo. Chci, aby se mé nehody braly vážně. Potom dodal: Tak ty taky přicházíš z nebe! Z které jsi planety?",
          "context": "Úryvek je ze začátku díla. V úryvku je zobrazeno seznámení letce s Malým princem."
        },
        "languageDevices": [
          "Apoziopeze – 'Je to letadlo...', 'Jé, to je divné...', 'Pravda, na tomhle jsi nemohl přijít z moc velké dálky...'",
          "Věty zvolací – 'Jejda! Ty jsi spadl z nebe!', 'Tak ty taky přicházíš z nebe!'",
          "Citoslovce – 'Jejda!', 'Jé!'",
          "Ustálené spojení slov – 'brát vážně', 'hned mi svitlo'",
          "Zdrobnělina – 'beránka', 'človíčku'"
        ],
        "literaryDevices": [
          {
            "name": "Kontrast",
            "example": "'A malý princ se roztomile zasmál. To mě hrozně pohněvalo.'"
          },
          {
            "name": "Metonymie",
            "example": "'vyndal mého beránka z kapsy' (beránek je kresba)"
          },
          {
            "name": "Metafora",
            "example": "'A nadlouho se ponořil do snění.', 'zabral se do pozorování svého pokladu'"
          },
          {
            "name": "Personifikace",
            "example": "'jakou zvědavost ve mně probudila ta zmínka o jiných planetách'"
          }
        ],
        "authorContext": {
          "bio": "Antoine de Saint-Exupéry (1900, Lyon, Francie – 1944) – francouzský spisovatel, letec, filozof, humanista. Syn hraběte, říkali mu Král Sluníčko pro jeho modré oči a blonďaté vlasy.",
          "life": [
            "Psal prózu pro dospělé",
            "Vojenskou službu nastoupil roku 1921, na vlastní žádost byl přidělen k letectvu",
            "Byl civilním letcem v severní Africe a Jižní Americe",
            "Roku 1936 byl vyslán jako reportér do Španělska, kde zuřila občanská válka",
            "Pokusil se o dálkový let New York – Ohňová země, ale v Guatemale došlo k havárii a Exupéry utrpěl četné zlomeniny",
            "Za 2. světové války zahynul při průzkumném letu, pravděpodobně nad Středozemním mořem nedaleko Korsiky"
          ],
          "otherWorks": [
            {
              "title": "Noční let",
              "year": "1931",
              "note": "Román čerpá z jeho zkušeností ředitele společnosti Aeroposta Argentina, která dopravovala poštu na první velké jihoamerické letecké lince."
            },
            {
              "title": "Země lidí",
              "year": "1939",
              "note": "Próza, která je souborem osmi statí a vzpomínek na zavádění prvních poštovních linek mezi Evropou a severní Afrikou."
            },
            {
              "title": "Kurýr na jih",
              "year": "1929",
              "note": "Román, který autor napsal v Africe, kde byl v té době ředitelem pouštního civilního letiště."
            }
          ],
          "workPosition": "Vrcholná a nejznámější kniha autora."
        },
        "literaryContext": {
          "movement": "Francouzská próza mezi válkami",
          "period": "1. polovina 20. století",
          "description": "Vliv 1. světové války. Přibývá prvků absurdity, negativní postoj ke společnosti. Poezie více subjektivní, autoři experimentují s jazykem. Existenciální otázky a jejich řešení.",
          "characteristics": [
            "Vliv 1. světové války",
            "Přibývá prvků absurdity",
            "Negativní postoj ke společnosti",
            "Poezie více subjektivní, autoři experimentují s jazykem",
            "Existenciální otázky a jejich řešení"
          ],
          "otherAuthors": [
            {
              "name": "Romain Rolland",
              "years": "1866–1944",
              "note": "Prozaik, dramatik, esejista, hudební historik a literární kritik. Představitel ztracené generace. Nositel Nobelovy ceny za literaturu (1915).",
              "works": [
                "Jan Kryštof",
                "Petr a Lucie",
                "Dobrý člověk ještě žije"
              ]
            },
            {
              "name": "Anatole France",
              "years": "1844–1924",
              "note": "Nositel Nobelovy ceny 1921. Aktivní v politice. Začínal poezií, poté psal romány – filozofické reflexe, kritika společnosti, silná ironie.",
              "works": [
                "Ostrov tučňáků"
              ]
            },
            {
              "name": "Henri Barbusse",
              "years": "1873–1935",
              "note": "Autor protiválečné literatury. Sugestivní líčení válečných hrůz.",
              "works": [
                "Oheň"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Kniha je aktuální, protože na světě má přátelství velmi důležitou roli a lidé budou mít vždy rozdílné vlastnosti.",
          "audience": "Kniha je určena dospělým lidem, aby nemysleli pouze na sebe, ale i na ostatní, a hlavně na děti.",
          "purpose": "V díle je zobrazeno mnoho špatných lidských vlastností, se kterými autor jistě nesouhlasil. Ukazuje, jak je důležité přátelství (letec + princ).",
          "similarWorks": [],
          "adaptations": [
            "Malý princ – film s muzikálními prvky, vychází ze stejného základu jako kniha. Odehrává se tam stejný příběh s drobnými odchylkami. Hlavně obsazení planet se liší, například ve filmu není zobrazen pijan a lampář."
          ]
        }
      }
    },
    {
      "id": 8,
      "title": "Petr a Lucie",
      "author": "Romain Rolland",
      "period": "Světová literatura 20. a 21. století",
      "genre": "Novela",
      "literaryForm": "Próza",
      "year": "1920",
      "keywords": [
        "francouzská literatura",
        "první světová válka",
        "láska",
        "protiválečná literatura"
      ],
      "analysis": {
        "titleAnalysis": "Petr a Lucie – jména hlavních hrdinů, jejichž tragická láska stojí v centru příběhu.",
        "plot": "Osmnáctiletý Petr Aubier vyrůstá v měšťanské rodině. Jeho otec je soudce a jeho starší bratr se před několika lety dobrovolně přihlásil do války. Petr musí za půl roku nastoupit do války, kterou nedokáže pochopit a smířit se s tím. A tak celé dny bloumá po Paříži a přemýšlí nad nesmyslností války a nad smyslem života.\n\nPři náletu na Paříž 30. ledna 1918 se Petr stejně jako spousta lidí jde rychle ukrýt do podzemní dráhy. Tam se poprvé střetne s Lucií a zahoří k ní velkou láskou. Ze strachu se i chytnou za ruce, na další zastávce však dívka vystoupí, aniž by si všimla mladíka po svém boku. Petr od té doby nemyslel na nic jiného než na Lucii. Dál se toulá Paříží a doufá, že dívku někde potká. Když se tak náhodou stane, není schopen vůbec promluvit.\n\nPři dalším setkáním se Petr osmělí a dá se s dívkou do řeči. Tak se seznamují. Petr se dozvídá dívčino jméno a něco o jejím životě. Dále se dozvídá o dívčině práci. Lucie se živí jako malířka, která překresluje známé obrazy a fotografie. Žije s maminkou, která ovšem kvůli práci v továrně nebývá moc doma a s Lucií se odcizila. Kvůli válce a smrti svého tatínka Lucie nedostudovala malířství.\n\nOba se do sebe zamilují spojeni poutem vzájemné úcty a porozumění. Ve světě beznaděje a utrpení si vytvoří vlastní svět. Svět, kde naděje vítězí nad válkou. Oba si uvědomují, že Petrovi se čas do narukování krátí, ale i tak sní o radostné budoucnosti. Avšak ani oni dva neuniknou vnějšímu světu plného nenávisti a smrti. O Velkém pátku, když se rozhodli přislíbit si lásku v chrámu svatého Gervasia, byl chrám zbombardován a oba milence pohřbil pod velkým padajícím pilířem.",
        "themes": {
          "main": "Zoufalý protest proti válce, utrpení, smrti; shakespearovský motiv – láska je silnější než smrt",
          "motifs": [
            "pohled",
            "rusovláska",
            "pilíř",
            "srdce",
            "bombardování",
            "válka",
            "láska",
            "smrt"
          ]
        },
        "setting": {
          "place": "Chrám sv. Gervasia, Paříž",
          "time": "Jaro za první světové války (od 30. 1. do Velkého pátku 29. 3. 1918)"
        },
        "composition": {
          "structure": "Děj se odvíjí chronologicky",
          "timeline": "Příběh se odehrává v rozmezí několika měsíců"
        },
        "characters": [
          {
            "name": "Petr",
            "description": "Mladý, upřímný, uzavřený, milý, snílek, často se rozčiluje nad světem. Osmnáctiletý student, který musí za půl roku nastoupit do války.",
            "isMain": true
          },
          {
            "name": "Lucie",
            "description": "Mladá, svěží, klidná, veselá, něžná, citlivá, prostá a optimistická dívka, která přes svoji chudobu a válku dokáže vnímat krásy světa. Žije přítomností. Živí se jako malířka.",
            "isMain": true
          },
          {
            "name": "Filip",
            "description": "Petrův starší bratr, který se dobrovolně přihlásil do války. Během ní ale přichází o veškeré iluze, a když vidí iluze ve svém bratrovi, je vůči němu odtažitý. Rád vidí Petra šťastného a zamilovaného.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Er-forma – vševědoucí vypravěč",
          "style": "Vypravěčův monolog, pouze pásmo vypravěče v er-formě"
        },
        "excerpt": {
          "text": "V té chvíli Lucie, jež zrovna vášnivým pohledem políbila drahého přítele (oči maje přivřeny a rty pootevřeny, zdál se ztracen v slastné extázi, a jakoby nadnášen věčnou radostí, pozdvihoval hlavu k oné nejvyšší Síle, kterou člověk pudově hledá vždycky nahoře), užasle spatřila v červeném a zlatém okně postranní kaple tvář té rusovlásky. A zatímco tak na ni mlčky pohlížela, trnouc úžasem, znovu na té zvláštní tvářičce uviděla onen výraz zděšení a soucitu. V témž okamžiku se silný pilíř, o nějž se opírali, pohnul a celý kostel se do základů zachvěl.",
          "context": "Úryvek je finální část příběhu, kde Petr s Lucií umírají v náručí při bombardování kostela."
        },
        "languageDevices": [
          "Přechodník – 'maje', 'trnouc', 'nemajíc'",
          "Zdrobnělina – 'tvářičce', 'klubíčko'"
        ],
        "literaryDevices": [
          {
            "name": "Epiteton",
            "example": "'vášnivým pohledem', 'v slastné extázi', 'mateřským objetím', 'nepatrné klubíčko'"
          },
          {
            "name": "Metafora",
            "example": "'vášnivým pohledem políbila drahého přítele'"
          },
          {
            "name": "Personifikace",
            "example": "'k oné nejvyšší Síle', 'tvář té rusovlásky', 'silný pilíř se pohnul', 'kostel se zachvěl', 'pilíř je pohřbil'"
          },
          {
            "name": "Přirovnání",
            "example": "'aby ho jako slepice svá kuřátka'"
          },
          {
            "name": "Synekdocha",
            "example": "'drahou hlavu ze všech sil přitiskla'"
          }
        ],
        "authorContext": {
          "bio": "Romain Rolland (1866–1944) – francouzský dramatik, prozaik, literární kritik a hudební historik. Narodil se v burgundském městečku Clamecy jako syn notáře.",
          "life": [
            "V roce 1880 se rodina na nátlak matky přestěhovala do Paříže, aby zde jejich syn mohl získat nejlepší vzdělání",
            "V Paříži vystudoval v letech 1886–1889 elitní školu Ecole Normale Supérieure. Poté začal studovat v Římě, kde také zahájil svoji literární činnost",
            "V letech 1893–1912 přednášel jako profesor dějiny umění na Ecole Normale a dějiny hudby na Sorbonně",
            "Od roku 1912 se již věnoval pouze umělecké činnosti",
            "V roce 1915 získal jako jeden z prvních na světě Nobelovu cenu za literaturu",
            "Po 1. světové válce usiloval o založení jednotné kulturní fronty proti válce a fašismu",
            "Zemřel v roce 1944 v Burgundsku, ve městečku Vézelay poblíž svého rodiště"
          ],
          "otherWorks": [
            {
              "title": "Jan Kryštof",
              "year": "1904–1912",
              "note": "Román o deseti dílech, rozvržen do čtyř částí. Líčí život Jana Kryštofa, slavného německého hudebníka. Za toto dílo dostal autor Nobelovu cenu."
            },
            {
              "title": "Okouzlená duše",
              "year": "1922–1933",
              "note": "Druhý autorův rozsáhlý románový cyklus. Román zrcadlí historický vývoj francouzské a evropské společnosti na počátku 20. století a v době nástupu fašismu v Itálii."
            },
            {
              "title": "Dobrý člověk ještě žije",
              "year": "1939",
              "note": "Svérázný historický román odehrávající se v Burgundsku za vlády Ludvíka XIII. Ústřední myšlenkou je, že hrdina dokáže žít šťastně i v nešťastných poměrech."
            }
          ],
          "workPosition": "Vydáno roku 1920. V díle se částečně promítá i autorův osobní zážitek. Při bombardování Paříže na Velký pátek roku 1918 mu zemřela žena spolu s několika jeho dalšími přáteli."
        },
        "literaryContext": {
          "movement": "První světová válka ve světové literatuře",
          "period": "Konec 19. století, první polovina 20. století",
          "description": "Literatura ovlivněná první světovou válkou, protiválečné tendence, zobrazování hrůz války a jejích dopadů na jednotlivce i společnost.",
          "characteristics": [
            "Protiválečná literatura",
            "Zobrazování hrůz války",
            "Důraz na lidské hodnoty",
            "Kritika společnosti",
            "Humanistické ideály"
          ],
          "otherAuthors": [
            {
              "name": "Ernest Hemingway",
              "years": "1899–1961",
              "note": "Americký spisovatel, čelní představitel Ztracené generace. Nositel Pulitzerovy ceny (1953) a Nobelovy ceny (1954).",
              "works": [
                "Sbohem, armádo!",
                "Stařec a moře"
              ]
            },
            {
              "name": "Erich Maria Remarque",
              "years": "1898–1970",
              "note": "Vlastním jménem Erich Paul Remark, německý spisovatel. Roku 1916 odešel jako dobrovolník do 1. světové války, v roce 1918 byl raněn.",
              "works": [
                "Na západní frontě klid",
                "Cesta zpátky",
                "Tři kamarádi",
                "Čas žít, čas umírat"
              ]
            },
            {
              "name": "Arnold Zweig",
              "years": "1887–1968",
              "note": "Německý spisovatel, prozaik a dramatik. První světovou válku prožil u Verdunu a na srbské frontě.",
              "works": [
                "Válka bílých mužů"
              ]
            },
            {
              "name": "Henri Barbusse",
              "years": "1873–1935",
              "note": "Francouzský spisovatel, kritik a publicista. Jako dobrovolník se přihlásil do armády a bojoval v přední linii.",
              "works": [
                "Oheň aneb Deník bojového družstva"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup, Lucie s Petrem vedou časté dialogy",
          "relevance": "Dílo dnes už sice není aktuální, ale můžeme ho brát do jisté míry i jako historicky naučné, neboť obsahuje fakta a podává jasný obraz o bombardování Paříže v době, kdy se dílo odehrává.",
          "audience": "Kniha je určená všem věkovým kategoriím.",
          "purpose": "Zoufalý protest proti válce, utrpení, smrti; shakespearovský motiv, láska je silnější než smrt.",
          "similarWorks": [
            {
              "title": "Romeo a Julie",
              "author": "William Shakespeare",
              "year": "1597",
              "note": "Motiv zabitých milenců"
            },
            {
              "title": "Romeo, Julie a tma",
              "author": "Jan Otčenášek",
              "year": "1958",
              "note": "Motiv zabitých milenců"
            }
          ],
          "adaptations": [
            "Československý film natočený režisérem Tiborem Rakovským vznikl v roce 1968. Režisér vynechal určité pasáže z knihy a nahradil je vlastními, kde ukazuje atmosféru na vojně a bídu mezi lidmi. Film získal na ČSFD hodnocení 85 %."
          ]
        }
      }
    },
    {
      "id": 9,
      "title": "Na západní frontě klid",
      "author": "Erich Maria Remarque",
      "period": "Světová literatura 20. a 21. století",
      "genre": "Román",
      "literaryForm": "Próza",
      "year": "1929",
      "keywords": [
        "německá literatura",
        "první světová válka",
        "ztracená generace",
        "protiválečná literatura"
      ],
      "analysis": {
        "titleAnalysis": "Na západní frontě klid  protože se na západní frontě bojovalo a v den, kdy hlavní hrdina umřel, noviny psaly, že se již nebojuje. V originále Im Westen nichts Neues.",
        "plot": "Kniha vypráví příběh Paula Bäumera, který je spolu se svými kamarády Müllerem, Kroppem, Kemmerichem a Leerem po maturitě donucen profesorem Kantorkem jít do armády jako dobrovolník.\\n\\nNejprve prošli tvrdým 10denním výcvikem plným šikany od desátníka Himmelstosse. Po výcviku nastupují všichni rovnou na frontu a hned při prvním boji je raněn jejich kamarád Kemmerich, který dostal kulku do stehna. Nohu mu musí amputovat.\\n\\nPo tomto boji utrpěla jejich rota velké ztráty a byla doplněna o rekruty. Vojáci přežívají v zákopech díky neuvěřitelnému množství drobných náhod. Pavlovi kamarádi jeden po druhém umírají.\\n\\nPavel dostane dovolenou a jede za rodinou. Dozvídá se, že jeho maminka umírá na rakovinu. Pavel zatajuje před rodiči všechny hrůzy, které zažil a viděl. Navštěvuje matku zesnulého Kemmericha a oznamuje jí, že její syn zemřel.\\n\\nPo dovolené je vyslán na průzkum terénu. Zabíjí tam Francouze, protože když ho nezabije, zabije Francouz jeho. Pak svého činu velmi lituje. Pavel a Kropp jsou zraněni a pobývají v katolické nemocnici. Kroppovi amputují nohu.\\n\\nKdyž se Pavel uzdraví, vrací se na frontu, kde zjistí, že Leer a Müller jsou mrtví. Pavlův nejlepší přítel Katczinski je zraněn a umírá. Pavel zůstává na frontě sám, bez svých kamarádů. Na konci války umírá i Pavel právě v den, který byl tak tichý, že vrchní velitelství napsalo do zprávy: Na západní frontě klid.",
        "themes": {
          "main": "Návštěva ve vojenské nemocnici, zobrazení válečných hrůz a varování před nimi",
          "motifs": [
            "karbol",
            "úsměv",
            "hodinky",
            "noha",
            "válka",
            "smrt",
            "přátelství",
            "zákopy"
          ]
        },
        "setting": {
          "place": "Západní fronta, Německo",
          "time": "1. světová válka (19141918)"
        },
        "composition": {
          "structure": "Děj je vyprávěn chronologicky",
          "timeline": "Příběh sleduje válečné období"
        },
        "characters": [
          {
            "name": "Pavel Bäumer",
            "description": "Vypravěč, chytrý, citlivý, přátelský mladý voják",
            "isMain": true
          },
          {
            "name": "František Kemmerich",
            "description": "Citlivý, přišel o nohu, první z kamarádů, kdo umírá",
            "isMain": false
          },
          {
            "name": "Müller",
            "description": "Je nemotora, tvrdohlavec",
            "isMain": false
          },
          {
            "name": "Kropp",
            "description": "Starostlivý kamarád Pavla",
            "isMain": false
          },
          {
            "name": "Stanislav Katczinský",
            "description": "Nejlepší přítel Pavla, původním povoláním švec, přímý, statečný",
            "isMain": false
          },
          {
            "name": "Kantorek",
            "description": "Třídní profesor, podporoval své studenty v tom, aby šli do války",
            "isMain": false
          },
          {
            "name": "Himmelstoss",
            "description": "Velitel výcviku, tvrdý, drsný, bezcitný",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Ich-forma, vypravěčem je Pavel Bäumer",
          "style": "Převažuje pásmo vypravěče v ich-formě, přímá řeč postav"
        },
        "excerpt": {
          "text": "Než vyrazíme ke Kemmerichovi, balíme jeho věci; bude jich po cestě potřebovat. V polním lazaretu je hodně práce; páchne tam jako vždy karbolem, hnisem a potem. Člověk je z baráku na ledacos zvyklý, ale tady by ti přec jen mohlo přijít na nic. Ptáme se po Kemmerichovi; leží v jednom sále a uvítá nás slabým úsměvem radosti a bezmocným rozčilením.",
          "context": "Úryvek je ze začátku díla, Kemmerich je první, kdo umírá."
        },
        "languageDevices": [
          "Archaická vazba  bude jich po cestě potřebovat",
          "Výčet  páchne tam jako vždy karbolem, hnisem a potem",
          "Nespisovné slovo  baráku, saniťák",
          "Vulgarismus  držel hubu",
          "Zdrobnělina  Frantíku",
          "Vojenský slang  lazaret, sál, svrchnice"
        ],
        "literaryDevices": [
          {
            "name": "Přirovnání",
            "example": "jako vždy"
          },
          {
            "name": "Epiteton",
            "example": "slabým úsměvem radosti a bezmocným rozčilením"
          },
          {
            "name": "Eufemismus",
            "example": "Kemmerich už z toho sálu nevyjde"
          }
        ],
        "authorContext": {
          "bio": "Erich Maria Remarque (18981970)  vlastním jménem Erich Paul Remark, německý spisovatel.",
          "life": [
            "Narodil se 22. června 1898 v Osnabrücku do rodiny knihvazače",
            "Hned po ukončení školy v roce 1916 narukoval do armády, kde byl v roce 1918 několikrát raněn",
            "Kvůli tomu je celé jeho dílo poznamenáno odporem k válce a antimilitarismem",
            "Po návratu z války měl problémy začlenit se do normální společnosti",
            "Po 1. světové válce vystřídal řadu povolání",
            "Roku 1931 se přestěhoval do Švýcarska",
            "V roce 1938 byl zbaven německého občanství, jeho knihy byly veřejně páleny",
            "1939 emigroval do New Yorku",
            "Zemřel 25. září 1970 v Locarnu"
          ],
          "otherWorks": [
            {
              "title": "Cesta zpátky",
              "year": "1931",
              "note": "Volné pokračování románu Na západní frontě klid"
            },
            {
              "title": "Tři kamarádi",
              "year": "1936",
              "note": "Román o osudech vojáků po válce"
            },
            {
              "title": "Vítězný oblouk",
              "year": "1945",
              "note": "Román o německém emigrantovi v Paříži"
            },
            {
              "title": "Čas žít, čas umírat",
              "year": "1954",
              "note": "Román o 2. světové válce"
            }
          ],
          "style": "V dílech se blíží stylu tzv. ztracené generace. Silné antifašistické zaměření, humanista, kritik společnosti.",
          "workPosition": "Prvotina, světový úspěch  jeho zřejmě nejznámější dílo."
        },
        "literaryContext": {
          "movement": "Ztracená generace, protiválečná literatura",
          "period": "1. polovina 20. století",
          "description": "Zobrazení válečné tematiky, cílem bylo vylíčit válečné hrůzy a varovat před nimi.",
          "characteristics": [
            "Zobrazení válečných hrůz",
            "Protiválečná literatura",
            "Kritika společnosti",
            "Odpor k válce a antimilitarismus"
          ],
          "otherAuthors": [
            {
              "name": "Arnold Zweig",
              "years": "18871968",
              "note": "Německý prozaik a dramatik",
              "works": [
                "Spor o seržanta Gríšu"
              ]
            },
            {
              "name": "Romain Rolland",
              "years": "18661944",
              "note": "Francouzský prozaik, nositel Nobelovy ceny (1915)",
              "works": [
                "Petr a Lucie"
              ]
            },
            {
              "name": "Henri Barbusse",
              "years": "18741935",
              "note": "Francouzský spisovatel",
              "works": [
                "Oheň aneb deník bojového družstva"
              ]
            },
            {
              "name": "Ernest Hemingway",
              "years": "18991961",
              "note": "Americký prozaik, nositel Nobelovy ceny (1954)",
              "works": [
                "Sbohem, armádo",
                "Stařec a moře"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Dílo je aktuální, jelikož v některých zemích se stále válčí.",
          "audience": "Čtenář, kterému nevadí popis zmrzačených lidí a pravda o válce.",
          "purpose": "Tato kniha nechce být ani obžalobou, ani vyznáním. Chce se pokusit vydat svědectví o generaci, která byla válkou rozbita  i když unikla jejím granátům.",
          "similarWorks": [
            {
              "title": "Oheň aneb Deník bojového družstva",
              "author": "Henri Barbusse",
              "year": "1916",
              "note": "Zachycuje každodenní život vojáků"
            }
          ],
          "adaptations": [
            "Na západní frontě klid  Delbert Mann, 1979"
          ]
        }
      }
    },
    {
      "id": 10,
      "title": "Velký Gatsby",
      "author": "Francis Scott Fitzgerald",
      "period": "Světová literatura 20. a 21. století",
      "genre": "Román",
      "literaryForm": "Próza",
      "year": "1925",
      "keywords": [
        "americká literatura",
        "ztracená generace",
        "jazzový věk",
        "20. léta"
      ],
      "analysis": {
        "titleAnalysis": "Velký Gatsby  přezdívka hlavního hrdiny Jay Gatze, který je velmi zámožný.",
        "plot": "Nick Carraway se po první světové válce přestěhoval do New Yorku. Pracuje zde jako makléř. Jeho novým sousedem na Long Islandu, tzv. Západním vejci, je Jay Gatz řečený Velký Gatsby. Ten pořádá nákladné večírky a je oblíbený široko daleko.\\n\\nNa Západním vejci bydlí také Nickova vzdálená sestřenice Daisy, její manžel Tom Buchanan a malá dcerka. Tom je Daisy nevěrný s Myrtle Wilsonovou, manželkou automechanika.\\n\\nNick na večírku poznal Daisyinu přítelkyni, hráčku golfu Jordan. Gatsby se původně jmenoval Gatz a byl z chudých poměrů. Utekl z domova a postupně si vydělal dost peněz. Potom poznal Daisy a bezhlavě se do ní zamiloval.\\n\\nGatsby Nicka poprosí, jestli by se s Daisy nemohl setkat v jeho domě. Znovu se stávají milenci. Gatsby Tomovi řekne, že ho jeho žena nemiluje. Po nastalé hádce Daisy a Gatsby odjíždějí Gatsbyho autem, řídí Daisy a v rozrušení přejede a zabije ženu, která proti autu vyběhla. Touto ženou je Myrtle, milenka Toma.\\n\\nManžel zabité ženy Wilson se dozví, že auto patří Gatsbymu. Rozhodne se pomstít a zastřelí Gatsbyho v jeho domě. Následně se sám střelí. Nick zdrceně sleduje, že na Gatsbyho pohřeb nikdo nepřišel.",
        "themes": {
          "main": "Kritika amerického snu a povrchnosti vyšší společnosti",
          "motifs": [
            "Západní vejce",
            "sousedství",
            "svíčky",
            "večírky",
            "bohatství",
            "láska",
            "smrt"
          ]
        },
        "setting": {
          "place": "USA, New York  Západní vejce, dům manželů Buchananových",
          "time": "20. léta 20. století"
        },
        "composition": {
          "structure": "Vyprávění chronologické a retrospektivní",
          "timeline": "Text je rozdělen na odstavce"
        },
        "characters": [
          {
            "name": "Nick Carraway",
            "description": "Makléř, vypravěč, který stojí v pozadí příběhu, z chudých poměrů, nezkažený, upřímný",
            "isMain": true
          },
          {
            "name": "Jay Gatsby",
            "description": "Vypracoval se sám, žije osaměle, až nekriticky miluje Daisy, pořádá večírky, ale nemá opravdové přátele",
            "isMain": true
          },
          {
            "name": "Daisy Buchananová",
            "description": "Zkažená zbohatlá panička, krásná, ale jen navenek",
            "isMain": false
          },
          {
            "name": "Jordan Bakerová",
            "description": "Sportovní typ, přítelkyně Nicka, hráčka golfu",
            "isMain": false
          },
          {
            "name": "Tom Buchanan",
            "description": "Nevěrný Daisyin manžel, zbohatlík",
            "isMain": false
          },
          {
            "name": "Myrtle",
            "description": "Tomova milenka, důvěřivá",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Ich-forma, vypravěčem je spisovatel Nick Carraway",
          "style": "Přímá řeč postav, dialog, pásmo vypravěče"
        },
        "excerpt": {
          "text": "Vy bydlíte na Západním vejci, poznamenala s opovržením. Znám tam někoho. Neznám tam ani živou  Přece musíte znát Gatsbyho. Gatsbyho? zeptala se Daisy. Jakého Gatsbyho?",
          "context": "Začátek knihy, kdy se Daisy dozví, že její dávná láska Gatsby bydlí poblíž."
        },
        "languageDevices": [
          "Přezdívka  Gatsby",
          "Řečnická otázka  Gatsbyho?",
          "Zdrobnělina  figurku"
        ],
        "literaryDevices": [
          {
            "name": "Apoziopeze",
            "example": "Neznám tam ani živou "
          },
          {
            "name": "Přirovnání",
            "example": "vyvedl mě z pokoje, jako by přesunoval figurku v dámě na jiné políčko"
          },
          {
            "name": "Epiteton",
            "example": "v ochablém větru"
          },
          {
            "name": "Metafora",
            "example": "celá rozzářená"
          }
        ],
        "authorContext": {
          "bio": "Francis Scott Key Fitzgerald (18961940)  Američan, spisovatel a scenárista, považován za jednoho z nejlepších amerických spisovatelů. Autor jazzového věku.",
          "life": [
            "Narozen v Minnesotě, z rodiny irských přistěhovalců",
            "Studoval v New Jersey a v Princetonu",
            "Dobrovolně narukoval, ale ve válce nikdy nebyl",
            "Po úspěchu prvního románu se oženil se Zeldou Sayrovou",
            "Vedli nákladný život, byli zadlužení",
            "V Paříži se seznámili s Hemingwayovými",
            "Pracoval jako scenárista v Hollywoodu",
            "Zemřel na infarkt v Hollywoodu"
          ],
          "otherWorks": [
            {
              "title": "Na prahu ráje",
              "year": "1920",
              "note": "Prvotina"
            },
            {
              "title": "Krásní a prokletí",
              "year": "1922",
              "note": "Román o americké smetánce"
            },
            {
              "title": "Něžná je noc",
              "year": "1934",
              "note": "Román o psychiatrovi"
            },
            {
              "title": "Poslední magnát",
              "year": "1941",
              "note": "Nedokončený, vydán posmrtně"
            }
          ],
          "style": "Píše o generaci 20. let, tzv. zlaté mládeži.",
          "workPosition": "Román se stal oblíbeným až v 50. letech, stal se povinnou četbou."
        },
        "literaryContext": {
          "movement": "Ztracená generace",
          "period": "1. polovina 20. století",
          "description": "Skupina spisovatelů narozených kolem roku 1900, kteří zažili první světovou válku.",
          "characteristics": [
            "Zklamání a skepse",
            "Rozklad lidských a společenských hodnot",
            "Hledání východiska v útěku do přírody nebo kultury",
            "Kritika společnosti"
          ],
          "otherAuthors": [
            {
              "name": "Ernest Hemingway",
              "years": "18991961",
              "note": "Americký spisovatel, nositel Nobelovy ceny",
              "works": [
                "Stařec a moře",
                "Sbohem, armádo"
              ]
            },
            {
              "name": "William Faulkner",
              "years": "18971962",
              "note": "Americký prozaik, nositel Nobelovy ceny",
              "works": [
                "Absolone, Absolone"
              ]
            },
            {
              "name": "John Steinbeck",
              "years": "19021968",
              "note": "Americký spisovatel",
              "works": [
                "O myších a lidech",
                "Hrozny hněvu"
              ]
            },
            {
              "name": "Erich Maria Remarque",
              "years": "18981970",
              "note": "Německý spisovatel",
              "works": [
                "Na západní frontě klid"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Honba za penězi a posuzování lidí podle jejich pověsti je stále aktuální.",
          "audience": "Kdokoli, kniha není úzce zaměřena.",
          "purpose": "Kritika amerického snu a povrchnosti vyšší společnosti ve 20. letech.",
          "similarWorks": [
            {
              "title": "Krásní a prokletí",
              "author": "F. S. Fitzgerald",
              "year": "1922",
              "note": "Zobrazení americké smetánky ve 20. letech"
            }
          ],
          "adaptations": [
            "Nejnovější zpracování (2013) s Leonardem Dicapriem má hodnocení 73 %"
          ]
        }
      }
    },
    {
      "id": 11,
      "title": "Farma zvířat",
      "author": "George Orwell",
      "period": "Světová literatura 20. a 21. století",
      "genre": "Alegorický román",
      "literaryForm": "Próza",
      "year": "1945",
      "keywords": [
        "anglická literatura",
        "antiutopie",
        "alegorie",
        "satira",
        "totalitarismus"
      ],
      "analysis": {
        "titleAnalysis": "Děj knihy se odehrává na zvířecí farmě.",
        "plot": "Příběh se odehrává na zvířecí farmě zvané Panská farma. Starý inteligentní kanec Mojžíš (Major) naučil ostatní prasata píseň Zvířata Anglie, čímž vznikl tzv. animalismus. Mojžíš nabádal ostatní k revoluci, která byla po jeho smrti uskutečněna a při které prasata převzala moc a vyhnala z farmy jejího majitele pana Jonese.\\n\\nFarmě dávají název Zvířecí farma a je sepsáno 7 pravidel, která všechna zvířata musí dodržovat. Zvířatům vládnou kanec Napoleon a kanec Kuliš, kteří se neustále dohadují. Napoleon všechny poštve proti Kulišovi a sám sebe učiní Velkým vůdcem.\\n\\nZvířata na farmě pracují mnohem více než dřív, ale jejich životní podmínky se nezměnily. Sedmero je upravováno v prasečí prospěch, a jakmile ostatní zvířata protestují, prasata je umlčí svými argumenty.\\n\\nPo roce je produkce farmy stále nižší, což se svádí na vyhnaného Kuliše. Zvířata odhalují jeho pomocníky a popravují je. I přikázání byla pozměněna, ale zvířata si myslí, že už si je správně nepamatují.\\n\\nZvířata se přestěhovala do domu, začala nosit šaty, spát v posteli, pít alkohol a obchodovat s lidmi. Postupně také začínají chodit po dvou. Napoleon farmě vrátil označení Panská. V závěru hrají všichni poker a není možné rozeznat, kdo je člověk a kdo prase. Na vratech už visí jen jediné pravidlo: Všechna zvířata jsou si rovna, ale některá jsou si rovnější.",
        "themes": {
          "main": "Varování před stalinskou hrůzovládou, varování před jakoukoli totalitní mocí",
          "motifs": [
            "kanec",
            "sen",
            "stodola",
            "farma",
            "sláma",
            "revoluce",
            "pravidla",
            "moc"
          ]
        },
        "setting": {
          "place": "Anglie, Panská farma",
          "time": "Není určen"
        },
        "composition": {
          "structure": "Kniha je rozdělena na 10 kapitol",
          "timeline": "Děj je vyprávěn chronologicky"
        },
        "characters": [
          {
            "name": "Major",
            "description": "Inteligentní prase, dvanáctiletý (starý), středně bílý, má představovat Lenina",
            "isMain": false
          },
          {
            "name": "Napoleon",
            "description": "Rvavé prase toužící po moci, zbaví se Kuliše, má představovat Stalina",
            "isMain": true
          },
          {
            "name": "Kuliš",
            "description": "Prase vládnoucí nejprve spolu s Napoleonem, má představovat Trockého",
            "isMain": false
          },
          {
            "name": "Boxer",
            "description": "Silný hřebec s bílým pruhem na nose, představuje pracující lid",
            "isMain": false
          },
          {
            "name": "Lupina",
            "description": "Statná klisna středního věku, dobračka",
            "isMain": false
          },
          {
            "name": "Benjamin",
            "description": "Osel intelektuál, pasivní, ačkoli si uvědomuje reálný stav věcí",
            "isMain": false
          },
          {
            "name": "pan Jones",
            "description": "Majitel farmy, rád se napil a zapomněl nakrmit zvířata",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Vševědoucí vypravěč v er-formě",
          "style": "Pouze pásmo vypravěče"
        },
        "excerpt": {
          "text": "Celý den se mezi zvířaty povídalo, že starý Major, výstavní středně bílý kanec, několikrát oceněný ve své kategorii, měl v noci podivný sen, který chtěl vyprávět ostatním. Zvířata se tedy dohodla, že až pan Jones usne, sejdou se ve velké stodole.",
          "context": "Úryvek je z počátku knihy, kdy ještě žije Major a farmu spravuje pan Jones."
        },
        "languageDevices": [
          "Spisovný jazyk",
          "Hypokoristika (domácí jména)  Bára, Janina",
          "Zdrobnělina  zvířátkům",
          "Nomen omen  hřebec Boxer"
        ],
        "literaryDevices": [
          {
            "name": "Metafora",
            "example": "co má na srdci"
          },
          {
            "name": "Eufemismus",
            "example": "nebyl opravdu příliš inteligentní"
          },
          {
            "name": "Alegorie",
            "example": "Celý příběh je alegorií na stalinský režim"
          }
        ],
        "authorContext": {
          "bio": "George Orwell (19031950)  vlastním jménem Eric Arthur Blair, britský novinář, esejista a spisovatel.",
          "life": [
            "Narodil se 25. června 1903 v Motihari v Indii",
            "Vyrůstal v Oxfordshiru a podle místní říčky Orwell si dal svůj pseudonym",
            "Vystudoval prestižní Eton College",
            "V roce 1922 pracoval pro Indickou imperiální policii v Barmě",
            "Po roce 1936 se jako dobrovolník zapojil do španělské občanské války",
            "Druhé světové války se neúčastnil kvůli vleklé tuberkulóze",
            "V roce 1950 na tuberkulózu zemřel",
            "V komunistickém Československu byl na seznamu zakázaných autorů"
          ],
          "otherWorks": [
            {
              "title": "1984",
              "year": "1949",
              "note": "Antiutopický román"
            },
            {
              "title": "Barmské dny",
              "year": "1934",
              "note": "Román odehrávající se v Barmě"
            },
            {
              "title": "Na dně v Paříži a Londýně",
              "year": "1933",
              "note": "Zážitky z dob, kdy byl Orwell tulákem"
            }
          ],
          "style": "Psal knihy o diktaturách komunistického typu. Jeho knihy a eseje se týkají politiky, komentují život doby.",
          "workPosition": "Farma zvířat a 1984 jsou nejznámější Orwellovy romány."
        },
        "literaryContext": {
          "movement": "Antiutopie, meziválečná anglická próza",
          "period": "30. až 50. léta 20. století",
          "description": "Literatura varující před totalitními režimy.",
          "characteristics": [
            "Alegorie na totalitní režimy",
            "Kritika komunismu a stalinismu",
            "Varování před zneužitím moci",
            "Satirické prvky"
          ],
          "otherAuthors": [
            {
              "name": "Jevgenij Zamjatin",
              "years": "18841937",
              "note": "Ruský autor antiutopií",
              "works": [
                "My"
              ]
            },
            {
              "name": "J. R. R. Tolkien",
              "years": "18921973",
              "note": "Anglický spisovatel",
              "works": [
                "Hobit",
                "Pán Prstenů"
              ]
            },
            {
              "name": "C. S. Lewis",
              "years": "18981963",
              "note": "Tolkienův kolega",
              "works": [
                "Letopisy Narnie"
              ]
            },
            {
              "name": "Edgar Rice Burroughs",
              "years": "18751950",
              "note": "Americký spisovatel",
              "works": [
                "Tarzan"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Hrozba totalitních režimů je stále aktuální.",
          "audience": "Člověk, který prožil totalitu a pozná jasné narážky na historické postavy a události. Člověk, který totalitu nepoznal a má být varován.",
          "purpose": "Varování před stalinskou hrůzovládou v Rusku v první polovině 20. století, varování před jakoukoli totalitní mocí.",
          "similarWorks": [
            {
              "title": "1984",
              "author": "George Orwell",
              "year": "1949",
              "note": "Hrůzy totalitního systému"
            },
            {
              "title": "Bajky",
              "author": "Jean de La Fontaine",
              "year": "17. stol.",
              "note": "Alegorické příběhy s poučením"
            }
          ],
          "adaptations": [
            "Farma zvířat  anglický animovaný film z roku 1954, na ČSFD hodnoceno 81 %"
          ]
        }
      }
    },
    {
      "id": 12,
      "title": "Vražda v Orient Expresu",
      "author": "Agatha Christie",
      "period": "Světová literatura 20. a 21. století",
      "genre": "Detektivní román",
      "literaryForm": "Próza",
      "year": "1934",
      "keywords": [
        "anglická literatura",
        "detektivka",
        "Hercule Poirot"
      ],
      "analysis": {
        "titleAnalysis": "Vražda v Orient expresu – zločin se odehrál ve vlaku s názvem Orient expres.",
        "plot": "Detektiv Hercule Poirot se vrací domů ze Sýrie, kde řešil případ. Ve vlaku do Cařihradu si všimne dvojice, Angličanky a jistého plukovníka, ale není si jist jejich vztahem. Do Cařihradu přijde Poirotovi telegram a on musí změnit trasu, aby se dostal do Londýna. Měl jet Orient expresem na trase Istanbul–Calais. S ním cestuje také Belgičan Bouc, ředitel železniční společnosti. Kupodivu je vlak zcela obsazený, ale nakonec se jedno místo uvolnilo. Celkem je zde 13 cestujících a mezi nimi i dvojice, kterou již Poirot potkal cestou.\n\nJeden z cestujících, velmi nepříjemný Američan Ratchett, se Poirotovi svěřil, že se bojí, že bude zavražděn, chodily mu totiž výhružné dopisy. Poirot mu ale odmítl pomoct. Během noci vjel vlak do závěje a zastavil se. Ráno byl Ratchett nalezen mrtvý – někdo ho ubodal. Zajímavé bylo, že některé z 12 bodných ran byly velmi slabé a některé zase velmi razantní. Hodinky se Ratchettovi zastavily v 01:15, což byl předpokládaný čas smrti. Další stopou byl dámský kapesník, čistič na dýmku a kousek výhružného dopisu. Poirot rozluštil zmínku o malé Daisy Armstrongové, což byla nedávno zavražděná dívenka, o jejímž případu se všude psalo. Přišel s odhalením, že Ratchett je onen vrah pod novou identitou.\n\nHercule Poirot postupně vyslechl všechny cestující, dělal si poznámky a načrtnul plánek vlaku. Zjistil, že jedna z podezřelých znala rodinu malé Daisy. Několik cestujících v noci vidělo projít kupé ženu v červeném županu, další viděli průvodčího na jeho židli na konci kupé a další zaslechli výkřik. Poirot provedl prohlídku kufrů, v jednom našel uniformu falešného průvodčího a v tom svém červené kimono.\n\nHercule si povšiml několika poznámek, zamyslel se a zjistil, že úplně všichni cestující měli něco do činění s rodinou Armstrongových. Došlo mu také, že se tu všichni sešli záměrně, a proto byl vlak plně obsazen i v zimě. Vydedukoval, že se všichni chtěli Ratchettovi pomstít, a z toho důvodu naplánovali zločin společně. Věděl dokonce přesně, jak to bylo a kdo hrál při vraždě jakou roli. Ratchett byl zavražděn 12 ranami, každou zasadil jiný cestující. Chápal, proč se Ratchettovi mstili, a tak vymyslel ještě jedno – náhradní – řešení. Když stál vlak v závěji, vlezl do vlaku vrah v uniformě průvodčího, zavraždil Ratchetta a zase uprchnul. Lékař i Poirotův přítel Bouc se shodli, že policii předloží tuto variantu, 12 skutečných vrahů tedy zůstalo nepotrestáno.",
        "themes": {
          "main": "Vyšetřování vraždy",
          "motifs": [
            "kapesníček",
            "čistič na lulku",
            "kimono"
          ]
        },
        "setting": {
          "place": "Vlak Orient expres na území Jugoslávie, vyšetřování probíhalo v jídelním voze",
          "time": "Není přesně určen; krátce po smrti pana Ratchetta, zima, rok 1929"
        },
        "composition": {
          "structure": "Příběh se skládá ze tří částí: Fakta, Výpovědi, Hercule Poirot si sedne a přemýšlí",
          "timeline": "Příběh je vyprávěn chronologicky, při rekonstrukci vraždy retrospektivně"
        },
        "characters": [
          {
            "name": "Hercule Poirot",
            "description": "Belgičan, detektiv, je neskutečně všímavý, pozorný, až geniální, zároveň výborný psycholog. Vystupuje mírně výstředně a ne každému je sympatický. Je popisován jako menší tmavovlasý muž s knírkem. O jeho soukromí nic nevíme.",
            "isMain": true
          },
          {
            "name": "Monsieur Bouc",
            "description": "Ředitel drah, snaží se být při vyšetřování nápomocný, ale sám by na nic nepřišel.",
            "isMain": false
          },
          {
            "name": "Lékař",
            "description": "Odborník ve svém oboru, přesně určil čas smrti a příčinu smrti.",
            "isMain": false
          },
          {
            "name": "Ratchett",
            "description": "Ve skutečnosti Casetti, vrah malé Daisy, chladnokrevný, zlý, krutý, všemi nenáviděný podvodník.",
            "isMain": false
          }
        ],
        "narration": {
          "narrator": "Vypravěč vystupuje v er-formě a sděluje čtenáři jen takové informace, které má k dispozici i vyšetřovatel Poirot (= vypravěč není vševědoucí).",
          "style": "V úryvku se v menší míře objevuje pásmo vypravěče, ve větší míře dialog (rozhovor) Poirota, lékaře a Bouca."
        },
        "excerpt": {
          "text": "Sám jste říkal, monsieur Poirote, vložil se do toho lékař, že dvě stopy je trochu moc. Souhlasím s monsieur Boucem. Kapesníček tam zůstal omylem, proto se žádná nepřizná, že jí patří. Čistič na lulku je falešná stopa. Pro tuto teorii mluví ostatně také to, že plukovník Arbuthnot, jak jste si všiml, bez váhání a otevřeně přiznal, že kouří lulku a že užívá čističe tohoto druhu.\n\nUsuzujete dobře, řekl Poirot.\n\nOtázka číslo 3 – kdo chodil v rudém kimonu? pokračoval monsieur Bouc. Přiznám se, že o tom nemám ani zdání. Máte na to nějaké vysvětlení, doktore?\n\nNemám.\n\nV tomto bodě jsme tedy bezradní a přiznáváme se k tomu. Ale příští otázka nám každopádně dává jakési možnosti. Kdo byl muž či žena převlečený nebo převlečená za průvodčího?",
          "context": "Úryvek je ze třetí části knihy, kdy k sobě Poirot skládá poslední indicie a dedukuje, kdo je vrah."
        },
        "languageDevices": [
          "Francouzské slovo – 'monsieur'",
          "Slovo zdrobnělé – 'kapesníček'",
          "Archaická větná vazba – 'užívá čističe'",
          "Výčet – Hardman, plukovník Arbuthnot, Foscarelli, hrabě Andrényi a Hector MacQueen…"
        ],
        "literaryDevices": [
          {
            "name": "Ironie",
            "example": "'dvě stopy je trochu moc'"
          },
          {
            "name": "Personifikace",
            "example": "'pro tuto teorii mluví to...'"
          },
          {
            "name": "Dysfemismus",
            "example": "'jsou příliš tlusté'"
          }
        ],
        "authorContext": {
          "bio": "Agatha Mary Clarissa Christie (1890–1976) – druhá nejprodávanější spisovatelka všech dob (první je W. Shakespeare), nejznámější spisovatelka všech dob.",
          "life": [
            "Z viktoriánské anglické rodiny, narozená jako Millerová",
            "Vyučována doma, poté na studiích v Paříži",
            "Výborně zpívala a hrála na klavír",
            "Provdala se roku 1914 za důstojníka Archibalda Christie, měli spolu dceru Rosalind, r. 1928 se rozvedli",
            "V první světové válce pracovala jako dobrovolná sestra a lékárnice",
            "R. 1926 se na 2 týdny ztratila, dodnes se neví, kam a proč",
            "Druhý manžel byl archeolog Max Mallowan",
            "Během druhé světové války pracovala ve výdejně léků",
            "Byla jmenována Komandérem britského impéria a z rukou královny získala titul Dáma britského impéria",
            "Díky manželovi mohla používat titul lady",
            "Vydávala asi jednu knihu ročně",
            "Celkem se prodalo přes 2 miliardy výtisků jejích knih",
            "Je překládána do více než 100 jazyků",
            "Někdy používala pseudonym Mary Westmacott – pod ním vyšlo 6 romantických románů",
            "Napsala 66 detektivních románů, 16 divadelních her a 14 povídkových souborů",
            "Nejslavnějšími detektivy jsou Hercule Poirot a slečna Marplová"
          ],
          "otherWorks": [
            {
              "title": "Záhada na zámku Styles",
              "year": "1921",
              "note": "první detektivka, poprvé Hercule Poirot"
            },
            {
              "title": "Vraždy podle abecedy",
              "year": "",
              "note": "jeden z nejznámějších románů"
            },
            {
              "title": "Smrt na Nilu",
              "year": "",
              "note": "detektivka s vyšetřovatelem Poirotem"
            },
            {
              "title": "Deset malých černoušků",
              "year": "",
              "note": "jeden z nejznámějších románů"
            },
            {
              "title": "Past na myši",
              "year": "",
              "note": "divadelní hra"
            },
            {
              "title": "Svědek obžaloby",
              "year": "",
              "note": "divadelní hra"
            }
          ],
          "workPosition": "Kniha vyšla roku 1934 a je jednou z mnoha autorčiných detektivek, v nichž vystupuje vyšetřovatel Hercule Poirot."
        },
        "literaryContext": {
          "movement": "Detektivní literatura",
          "period": "20. století",
          "description": "Jeden z nejoblíbenějších žánrů zábavné literatury, za zakladatele je považován Edgar Allan Poe. Vznikla až koncem 19. století, počátky můžeme najít již v 18. století (loupežnické a pikareskní romány). Detektivka = příběh se zápletkou, která je založena na zločinu (nejčastěji vraždě), který vyšetřuje detektiv.",
          "characteristics": [
            "Příběh založen na zločinu, nejčastěji vraždě",
            "Detektiv (profesionál, policista, soukromý detektiv, laik) vyšetřuje",
            "Čtenář sleduje spolu s vyšetřovatelem stopy",
            "Čtenář dedukuje z různých informací"
          ],
          "otherAuthors": [
            {
              "name": "Edgar Allan Poe",
              "years": "1809–1849",
              "note": "Romantický básník, prozaik, literární teoretik, esejista. Zakladatel detektivky, 'mistr krátké prózy'.",
              "works": [
                "Zánik domu Usherů",
                "Vražda v ulici Morgue",
                "Jáma a kyvadlo",
                "Zlatý brouk",
                "Černý kocour"
              ]
            },
            {
              "name": "Robert Louis Stevenson",
              "years": "1850–1894",
              "note": "Skotský romanopisec, básník, povídkář, cestopisec. 'Mistr krátké sevřené prózy', představitel novoromantismu.",
              "works": [
                "Ostrov pokladů",
                "Podivný případ dr. Jekylla a pana Hyda"
              ]
            },
            {
              "name": "Oscar Wilde",
              "years": "1854–1900",
              "note": "Ir, prozaik, dramatik, básník a esejista. Nejúspěšnější dramatik pozdně viktoriánského Londýna.",
              "works": [
                "Obraz Doriana Graye",
                "Jak je důležité míti Filipa"
              ]
            },
            {
              "name": "Arthur Conan Doyle",
              "years": "1859–1930",
              "note": "Ovlivnil podobu detektivního žánru svými příběhy o Sherlocku Holmesovi.",
              "works": [
                "Dobrodružství Sherlocka Holmese",
                "Pes baskervillský"
              ]
            }
          ]
        },
        "additionalInfo": {
          "dominantStyle": "Vyprávěcí slohový postup",
          "relevance": "Vraždy jsou stále aktuální téma, pouze vyšetřovací metody jsou dnes jiné. Ovšem i dnešní vyšetřovatelé musejí použít hlavně rozum, technika je pouze pomocný prostředek k odhalení vraha.",
          "audience": "Kdokoli, kdo má rád klasickou detektivku.",
          "purpose": "Příběh ukazuje, jak důležitý je zdravý lidský rozum a bystrý úsudek. Autorka čtenářům předložila stejná fakta, která měl k dispozici sám vyšetřovatel, ale jen on byl schopný odhalit vraha.",
          "similarWorks": [
            {
              "title": "Smrt na Nilu",
              "author": "Agatha Christie",
              "year": "",
              "note": "Detektivka s vyšetřovatelem Poirotem"
            }
          ],
          "adaptations": [
            "Film z roku 1974 – zcela neodpovídá předloze, ale neliší se v podstatných věcech",
            "Nejnovější zpracování z roku 2017 (USA, Malta, režie K. Branagh), roli zavražděného vraha hraje Johnny Depp"
          ]
        }
      }
    },
    {
      "id": 13,
      "title": "Němá barikáda",
      "author": "Jan Drda",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Povídka",
      "literaryForm": "Próza",
      "year": "1946",
      "keywords": [
        "česká literatura",
        "válka",
        "povstání"
      ],
      "analysis": null
    },
    {
      "id": 14,
      "title": "O myších a lidech",
      "author": "John Steinbeck",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Novela",
      "literaryForm": "Próza",
      "year": "1937",
      "keywords": [
        "americká literatura",
        "sociální román",
        "přátelství"
      ],
      "analysis": null
    },
    {
      "id": 15,
      "title": "Smrt krásných srnců",
      "author": "Ota Pavel",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Povídka",
      "literaryForm": "Próza",
      "year": "1971",
      "keywords": [
        "česká literatura",
        "autobiografie",
        "válka",
        "rodina"
      ],
      "analysis": null
    },
    {
      "id": 16,
      "title": "Ostře sledované vlaky",
      "author": "Bohumil Hrabal",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Novela",
      "literaryForm": "Próza",
      "year": "1965",
      "keywords": [
        "česká literatura",
        "válka",
        "film",
        "postmoderna"
      ],
      "analysis": null
    },
    {
      "id": 17,
      "title": "Bylo nás pět",
      "author": "Karel Poláček",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Román",
      "literaryForm": "Próza",
      "year": "1946",
      "pages": 155,
      "keywords": [
        "česká literatura",
        "humor",
        "dětství"
      ],
      "analysis": null
    },
    {
      "id": 18,
      "title": "Bílá Nemoc",
      "author": "Karel Čapek",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Drama",
      "literaryForm": "Drama",
      "year": "1937",
      "keywords": [
        "česká literatura",
        "divadlo",
        "antifašismus",
        "humanismus"
      ],
      "analysis": null
    },
    {
      "id": 19,
      "title": "R.U.R.",
      "author": "Karel Čapek",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Drama",
      "literaryForm": "Drama",
      "year": "1920",
      "keywords": [
        "česká literatura",
        "divadlo",
        "sci-fi",
        "robot"
      ],
      "analysis": null
    },
    {
      "id": 20,
      "title": "Saturnin",
      "author": "Zdeněk Jirotka",
      "period": "Česká literatura 20. a 21. století",
      "genre": "Humoristický román",
      "literaryForm": "Próza",
      "year": "1942",
      "keywords": [
        "česká literatura",
        "humor",
        "sluha"
      ],
      "analysis": null
    }
  ]
}